[
    {
        "look_id": 1000,
        "keywords": [
            "project management",
            "technical support",
            "software testing",
            "device configuration",
            "hardware manufacturers"
        ],
        "answer_text": "Black and McDonalds’ role will be project management and project administration. We will also be the primary contact for Technical Support, and will assist Transnomis in project documentation, software testing, training, and device configuration. Black & McDonald will also provide crucial expertise to facilitate engagement and communication with hardware manufacturers, particularly to achieve a resolution in troubleshooting issues when there is uncertainty if the issue is a result of hardware manufacturer error, or with the traffic management control system."
    },
    {
        "look_id": 1001,
        "keywords": [
            "ITS experience",
            "successful projects",
            "awards",
            "partnership"
        ],
        "answer_text": "Collectively B&M and Transnomis have many years of ITS and installation experience and are both recognized for successfully delivering similar type projects on time, and within budget. B&M and Transnomis have partnered on several successful high-profile projects, and two of those projects have recently won awards: Professional Engineers Ontario (PEO) York Chapter – Project of the Year (Small Project Category) 2023, and ITS Canada’s prestigious Smart Mobility Project of the Year Award 2022."
    },
    {
        "look_id": 1017,
        "keywords": [
            "planning phase",
            "TMaCS",
            "B&M Team",
            "virtual meetings",
            "draft plan"
        ],
        "answer_text": "In this phase we will plan out how the B&M / Transnomis Team will execute the TMaCS project in collaboration with HHB. We expect to carry out this planning phase remotely, with a weekly virtual meeting with the HHB Team. To ensure efficient completion of this phase, we propose the following weekly rhythm for all subtasks in this phase: Monday – Wednesday – B&M Team creates the draft plan; Thursday Zoom/Teams meeting with HHB – B&M Team presents the draft plan, and seeks HHB feedback and comments; Friday – B&M Team submits the draft plan to HHB for final review and approval."
    },
    {
        "look_id": 1022,
        "keywords": [
            "VMs",
            "remote access",
            "credentials",
            "VPN instructions"
        ],
        "answer_text": "HHB will provision the necessary virtual machines (VMs) and remote access for the B&M / Transnomis Team for this project. Deliverable (HHB): Credentials and VPN instructions regarding remote access to VMs."
    },
    {
        "look_id": 1005,
        "keywords": [
            "project team",
            "Smartmicro Radar",
            "high profile projects"
        ],
        "answer_text": "The project team has previously delivered two high profile projects featuring the Smartmicro Radar technology."
    },
    {
        "look_id": 1006,
        "keywords": [
            "ITS Central",
            "real time visualization",
            "vehicles",
            "bikes",
            "peds"
        ],
        "answer_text": "ITS Central has a unique and innovative real time animated visualization of vehicles, bikes, and peds, allowing operators to intuitively see speeds, vehicle size, locations, headway, and incidents at a glance."
    },
    {
        "look_id": 1007,
        "keywords": [
            "customizable",
            "modular",
            "future expansion"
        ],
        "answer_text": "Our project team’s software is customizable and modular, and ready for future expansion."
    },
    {
        "look_id": 1040,
        "keywords": [
            "project management",
            "coordination",
            "support",
            "training",
            "Smartmicro Sensors"
        ],
        "answer_text": "Black & McDonald will take responsibility for the following duties: Project management and coordination, Project updates and scheduling, Minutes of meetings, Coordination/Documentation of requests, communications, questions, and answers, Leading the gathering of requirements, Assist Transnomis in software testing, device configuration, and training, Coordinate with hardware manufacturers if required, Coordinate the on-site calibration of Smartmicro Sensors (required for integration of Smartmicro Sensors in ITS Central), Provide 24/7 product support throughout the maintenance period and assist in troubleshooting (particularly in determining whether or not an issue is hardware- or software-related)."
    },
    {
        "look_id": 1009,
        "keywords": [
            "Peter Short",
            "experience",
            "ITS technologies",
            "IMSA certified"
        ],
        "answer_text": "Peter has almost a decade of experience managing and facilitating the deployment of ITS technologies across Canada. As an International Municipal Signal Association (IMSA) certified technician and an experienced account manager, Peter understands the process of deploying complex hardware and software platforms for traffic and transportation applications."
    },
    {
        "look_id": 1010,
        "keywords": [
            "Afra Shokraei",
            "experience",
            "ITS field",
            "PMP",
            "Electronics Engineer"
        ],
        "answer_text": "Afra has over 17 years of experience in the ITS field as a PMP and Electronics Engineer. Afra has been involved with several P3 and major projects incorporating new ITS technologies and systems. This includes several years of experience on projects with the City of Toronto working on VMS replacement, Traffic Signal Control Systems, ATMS, toll systems, Intersection management, Traffic Counting Station, Speed Enforcement, and Adaptive systems."
    },
    {
        "look_id": 1011,
        "keywords": [
            "Yeatland Wong",
            "Transportation Association of Canada",
            "reversible lane systems",
            "guidelines"
        ],
        "answer_text": "Yeatland was also a member of the Project Steering Committee for Transportation Association of Canada’s Guidelines for the Planning, Design, Operation and Evaluation of Reversible Lane Systems, and worked extensively with the lead author on the research, review, and content of this important document."
    },
    {
        "look_id": 1013,
        "keywords": [
            "Current State Evaluation",
            "fact-finding mission",
            "in-person",
            "implementation"
        ],
        "answer_text": "Current State Evaluation is the sub-phase where the B&M / Transnomis Team performs an in-depth review of all existing conditions and information from HHB that are necessary for the successful implementation of the project. This phase will initially be conducted as a 'fact-finding mission' by B&M/Transnomis Team attending the HHB facility in person right after Project Kickoff."
    },
    {
        "look_id": 1014,
        "keywords": [
            "hardware assessment",
            "TMaCS",
            "integration",
            "network architecture",
            "device specifications"
        ],
        "answer_text": "We will perform an assessment on all hardware in-scope to be integrated with TMaCS. This includes gathering of the following information (without limitation): Network architecture diagram(s), Make/model of devices (confirmation of what is in the RFP), IP address, Port number, Network protocol (e.g., TCP or UDP), Credentials specific to the devices (e.g., community strings), Communication protocol used (e.g., NTCIP, Modbus, etc.), Documentations from device manufacturers (e.g., user manual, protocol specifications, etc.)."
    },
    {
        "look_id": 1016,
        "keywords": [
            "operational needs",
            "TMaCS",
            "assessment",
            "lane reversal",
            "dashboard needs"
        ],
        "answer_text": "We will perform an assessment on the operational needs that are beyond the existing system, or not captured on Day 4. This includes gathering of the following information (without limitation): Q&A and confirmation of understanding of the existing lane reversal operation, Further and in-depth discussions on what the existing is doing well and what can be improved in TMaCS to improve on the operations, Other significant operational requirements that should be captured in the TMaCS design, Report and dashboard needs in TMaCS."
    },
    {
        "look_id": 1116,
        "keywords": [
            "Highway Engineering",
            "Roadside Safety Design",
            "MTO Roadside Design Manual",
            "VMS signs"
        ],
        "answer_text": "Highway Engineering scope includes Roadside Safety Design in accordance with MTO’s Roadside Design Manual (May 2020) considering traffic on both Garden City Skyway as well as adjacent sideroads for all proposed roadside installations (new VMS signs, WDE towers) and adjacent existing hazards (e.g. light standards)."
    },
    {
        "look_id": 1019,
        "keywords": [
            "risk mitigation",
            "implementation",
            "upgrade",
            "strategies"
        ],
        "answer_text": "We will identify risks that may be involved in the implementation and upgrade and provide mitigation strategies. We will revise the implementation and upgrade plan if needed."
    },
    {
        "look_id": 1021,
        "keywords": [
            "lane control",
            "user interface",
            "TMaCS",
            "implementation",
            "System Demo"
        ],
        "answer_text": "Our developers will implement the TMaCS lane control user interface and control logic based on the mock-ups developed in the previous subtask. System Demos will be provided to HHB in project meetings to ensure the implementation meets the expectations of HHB. A formal System Demo is scheduled after the completion of primary development. This System Demo includes basic training, and a walk through of the features."
    },
    {
        "look_id": 1118,
        "keywords": [
            "geotechnical report",
            "field and laboratory analytical program",
            "borehole locations",
            "foundation design",
            "construction recommendations"
        ],
        "answer_text": "Following the completion of the field and laboratory analytical program, Englobe will evaluate the geotechnical conditions encountered at the discrete borehole locations and subsequently prepare a draft geotechnical report in accordance with the RFP. The geotechnical report will provide factual results of the investigation and foundation design and construction recommendations. The report will include drawings that show the overall Site and the position of the specific borehole locations investigated as part of the Geotechnical Investigation. The drawings will be made to an approximate scale of sufficient accuracy to identify the various site features and investigation locations during future site visits. In addition, borehole stratigraphic logs will be provided detailing the findings of the drilling activities. Upon receiving comments from the Client, Englobe will finalize an electronic version of the report."
    },
    {
        "look_id": 1024,
        "keywords": [
            "PostgreSQL",
            "TimescaleDB",
            "PostGIS",
            "ITS Central",
            "production VMs"
        ],
        "answer_text": "Our installation and configuration specialist will install and configure the PostgreSQL database (and its required extensions TimescaleDB and PostGIS) as well as the ITS Central web application and its integration gateway modules into the production VMs. Deliverable: ITS Central database and software installed and configured in Production VMs."
    },
    {
        "look_id": 1025,
        "keywords": [
            "hardware configuration",
            "ITS Central",
            "IP addresses",
            "port numbers"
        ],
        "answer_text": "Our hardware configuration specialist will configure hardware devices in ITS Central (e.g., IP addresses, port numbers, etc.). Communication to the devices will be confirmed. Deliverable: Hardware devices configured in ITS Central."
    },
    {
        "look_id": 1026,
        "keywords": [
            "data reports",
            "dashboards",
            "ITS Central"
        ],
        "answer_text": "We will configure data reports and dashboards based on the needs of HHB as assessed in the current state evaluation task. Deliverable: Pre-configured reports and dashboards in ITS Central."
    },
    {
        "look_id": 1065,
        "keywords": [
            "end-of-life",
            "migration plan",
            "ongoing support",
            "operating system"
        ],
        "answer_text": "Transnomis ITS Central software always supports the latest operating system and browser environments. If the operating system is coming to end-of-life, and an in-place OS upgrade is not feasible or deemed too risky, Transnomis will work with HHB on a migration plan to move the existing installation into the new server with the new OS. The plan will include scheduling, specific steps for the migration, go live plan on the new system and the decommissioning of the old system. This is included in the ongoing support and will not require a change order."
    },
    {
        "look_id": 1028,
        "keywords": [
            "QA",
            "SIT plan",
            "ITS Central",
            "hardware devices"
        ],
        "answer_text": "Our QA specialist will create a system integration test plan that focuses on testing ITS Central’s monitoring and control of hardware devices: VMS, gantry lane control signs, barrier gates and CCTV. The SIT plan will exercise all functions of these hardware. Where the tests require the control live traffic devices, we will coordinate with HHB on the necessary warnings and traffic control needed (e.g., testing the control of the gates). Deliverable: SIT Plan."
    },
    {
        "look_id": 1029,
        "keywords": [
            "QA",
            "test plan",
            "lane control logic",
            "GUI"
        ],
        "answer_text": "Our QA specialist will create a test plan that exercises the entire workflow of the lane control logic and GUI, including the routine scenarios (e.g., the daily third lane reversals) and the less frequent scenarios (e.g., one-way traffic only, incident blocking one lane on bridge). Deliverable: Lane Control Test Plan."
    },
    {
        "look_id": 1030,
        "keywords": [
            "automation QA",
            "testing script",
            "CI/CD",
            "lane control"
        ],
        "answer_text": "Our automation QA specialist will create the automation testing script to execute the lane control test plan. The automation test script will be integrated as part of the continuous integration and continuous delivery (CI/CD) process. All future changes to ITS Central will be tested against this test script and we can be assured that future enhancements and bug fixes will not break this new functionality. Note that we already have automation QA test script for all other existing ITS Central functions. Deliverable: Automation QA Implemented for Lane Control functionalities as part of the CI/CD process."
    },
    {
        "look_id": 1032,
        "keywords": [
            "documentation",
            "training",
            "user manuals",
            "admin manuals"
        ],
        "answer_text": "Our documentation/training specialist will create the user and admin manuals. It will be based on our existing ITS Central user/admin manuals, customized to HHB’s context and with the lane control functionality added. Deliverable: User and admin manuals."
    },
    {
        "look_id": 1033,
        "keywords": [
            "training plan",
            "in-person training",
            "HHB staff"
        ],
        "answer_text": "Our documentation/training specialist will create a training plan that includes step-by-step guides and fully hands-on exercises. Training will be provided in person to HHB staff during the weeks 23-24 of the project. Deliverable: Training plan and in-person training."
    },
    {
        "look_id": 1034,
        "keywords": [
            "go-live",
            "on-site support",
            "Transnomis",
            "TMaCS"
        ],
        "answer_text": "A date and time will be arranged with HHB to go-live with the new TMaCS. Transnomis staff will be available on-site to address any questions and provide additional support to the operations staff. All issues will be addressed in an expedited and urgent fashion. Deliverable: a successful go-live of TMaCS with on-site in person support from Transnomis."
    },
    {
        "look_id": 1035,
        "keywords": [
            "process review",
            "TMaCS",
            "incident response",
            "service management"
        ],
        "answer_text": "We will arrange meetings with the relevant HHB staff to review the processes that will utilize the TMaCS to track and coordinate incidents and services, including: Incident response, Security checks, Visual hardware inspection, Special events, Maintenance management. In the meetings, we will discuss how ITS Central can be configured and used in each of these contexts for HHB, as well as how it has been used in other jurisdictions dealing with similar issues. Deliverable: Incident and service management process review meetings and minutes."
    },
    {
        "look_id": 1037,
        "keywords": [
            "weather station",
            "automated messages",
            "VMS",
            "workshop"
        ],
        "answer_text": "We will arrange a workshop meeting with HHB to discuss and specify how weather station data (road conditions, temperature, etc.) will be used to create automated messages for the VMS, as well as alerts for the operators. Deliverable: Control logic workshop and minutes."
    },
    {
        "look_id": 1038,
        "keywords": [
            "go-live",
            "user training",
            "documentation",
            "risk mitigation"
        ],
        "answer_text": "In preparation for go live with this phase, we will: Update the user and admin manuals as needed, Provide user training, Reports and dashboard configuration, Create a go-live planning document that minimizes and mitigate risks involved. We anticipate the go-live with this phase will be far more straightforward than Phase 1.0. Deliverable: Phase 1.2 go live, with updated documentation and training."
    },
    {
        "look_id": 1039,
        "keywords": [
            "technology stack",
            "Windows",
            "Linux",
            "open-source",
            "PostgreSQL"
        ],
        "answer_text": "Transnomis is performing a technology stack upgrade such that by year 2024, ITS Central can be installed on either Windows or Linux OS. Since ITS Central relies on only off-the-shelf and open-source software (Linux and PostgreSQL databases), there are no third-party licenses required (e.g., database licenses)."
    },
    {
        "look_id": 1002,
        "keywords": [
            "Intelligent Transportation System",
            "ITS Central",
            "Advanced Traffic Management System",
            "VMS Central"
        ],
        "answer_text": "Transnomis has been building a comprehensive Intelligent Transportation System (ITS) called ITS Central to provide specialized ATMS control for ITS since 2007. Transnomis’ packaged service offerings include: ITS Central – a map-centric, modular Advanced Traffic Management System (ATMS) central software, VMS Central – a cloud-hosted solution available to work zone traffic safety companies, allowing them to configure and create their own 'Smart Work Zones.'"
    },
    {
        "look_id": 1042,
        "keywords": [
            "TMaCS",
            "ITS Central",
            "transportation agencies",
            "integration",
            "configuration"
        ],
        "answer_text": "The proposed TMaCS system will use a customized deployment of ITS Central, Transnomis’s flagship ATMS software. It has been implemented by many major transportation agencies including: Ontario Ministry of Transportation (MTO), City of Toronto, City of Edmonton, City of Loveland, Region of Waterloo, Region of Durham, Region of York, BC Ferries."
    },
    {
        "look_id": 1043,
        "keywords": [
            "ITS Central",
            "integration",
            "traffic management system",
            "scalability"
        ],
        "answer_text": "ITS Central seamlessly integrates internal systems, field traffic control devices, traffic data, and external data sources into a map-centric intelligent traffic management system. The solution scales to any organization’s size and needs, ranging from a small standalone application up to a large-scale advanced traffic management solution."
    },
    {
        "look_id": 1044,
        "keywords": [
            "TMaCS",
            "integration",
            "user interface",
            "dashboards",
            "enhancement"
        ],
        "answer_text": "For the TMaCS project, Transnomis will integrate the HHB devices per the RFP, and configure ITS Central to allow for integration of data and device control. During the engagement sessions, input will be taken from HHB to ensure that the user interface and dashboards reflect the needs of HHB’s existing processes, and to enhance those processes with the modern features of ITS Central’s capabilities."
    },
    {
        "look_id": 1003,
        "keywords": [
            "integrated traffic solutions",
            "government clients",
            "qualifications",
            "client base"
        ],
        "answer_text": "Transnomis believes their breadth and depth of experience in providing modern integrated traffic solutions to government entities of all sizes make them uniquely qualified for this project. Some of our clients include City of Toronto, Ontario Ministry of Transportation, City of Edmonton, City of Loveland (Colorado), Durham Region, Government of Northwest Territories, and British Columbia Ferries."
    },
    {
        "look_id": 1045,
        "keywords": [
            "data tracking",
            "reporting",
            "audit",
            "user activity",
            "transparency"
        ],
        "answer_text": "The system will have the ability to track and report what data changes were made, when they were made, and by which end user. All user accounts maintain detailed records of all activity taken, including logging in/out, downloading files, editing entities, and so on. An audit list showing date/time, IP, action taken, and account names is available, as is the ability to check an individual account and audit only their actions. Individual entities also support auditing, which shows all actions taken by all accounts that relate to that entity. These audits can be accessed by administrator accounts with the correct permissions, allowing for a high level of transparency and trackability within the system. In the TMaCS project, every step taken during lane reversals will be fully logged and auditable."
    },
    {
        "look_id": 1047,
        "keywords": [
            "data ownership",
            "data governance",
            "client consent",
            "data management",
            "customization"
        ],
        "answer_text": "Our clients always have full ownership and control of the data stored in our software. Transnomis and the B&M team do not claim ownership or make use of any client data outside of the project without client consent. ITS Central supports clients’ own unique data governance models. We understand that different organizations have their own unique processes, organization charts, and data collection systems. We have built ITS Central in such a way that can accommodate a wide variety of data governance models that work for organizations as large as the City of Toronto, Ontario Ministry of Transportation, and the City of Edmonton, to small towns and townships in Ontario such as the Township of Lanark Highlands."
    },
    {
        "look_id": 1048,
        "keywords": [
            "reporting capabilities",
            "data reporting",
            "pre-built reports",
            "configurable module",
            "data refresh"
        ],
        "answer_text": "The system should have configuration capabilities for reporting to meet ongoing Business needs. The system should have the ability to report on all system data through a reporting engine. The system should have the following pre-built reports; History reports, dates / times / messaging, how many signs, how many scheduled / unscheduled. Communication status reports for all devices. Reports are a highly configurable module in ITSC. Any number of standard reports can be easily created and saved according to desired specifications. These reports can contain a mixture of tabular and graph data (depending on the data used and the report options chosen) and will automatically refresh with new data every time a user opens them."
    },
    {
        "look_id": 1098,
        "keywords": [
            "occupational health",
            "safety",
            "environment",
            "workplace",
            "HSE commitment",
            "risk management"
        ],
        "answer_text": "B&M believes that excellence in occupational health, safety & environment is a philosophy inherent to how we do business in all aspects of our operations. We believe that the measures we take will help drive B&M closer to our vision of a workplace where “Nobody Gets Hurt Today or Tomorrow”. Our management team is committed to putting our people first in meeting our customer’s challenges in the most critical environments. B&M believes the most effective way to avoid any potential risks to people and the environment and to meet our HSE commitment is through a competent, committed workforce and practices designed to ensure the resultant risk is effectively managed proactively. We accomplish this by effective implementation of our Hazard Identification Elimination Risk Assessment & Control (HIERAC) processes and B&M HSE Manual."
    },
    {
        "look_id": 1050,
        "keywords": [
            "expandability",
            "future equipment",
            "data ingestion",
            "ITSC"
        ],
        "answer_text": "The system will provide expandability to include future equipment (physical assets) and services (e.g., data ingestion). ITSC is an extremely adaptable system with support for the ingestion of large amounts of data/new devices."
    },
    {
        "look_id": 1052,
        "keywords": [
            "performance management",
            "ITS Central",
            "performance optimization",
            "database tuning"
        ],
        "answer_text": "Ensuring that ITS Central remains performant at all times is one of our highest priorities. A number of performance-improving techniques are used throughout the platform, including: Database query tuning, Code review for performance optimization, Database table index, In-memory caching, Minification, Image sprites."
    },
    {
        "look_id": 1128,
        "keywords": [
            "custom reports",
            "performance monitoring",
            "collaboration",
            "configuration",
            "traffic data"
        ],
        "answer_text": "The Vendor shall provide custom reports for the purposes of monitoring performance of the System, which could include any or all event and traffic data gathered by the Solution. The Vendor shall collaborate with the Owner to determine the configuration, processing, and default content of the custom reports. A maximum of 10 reports will be requested."
    },
    {
        "look_id": 1054,
        "keywords": [
            "incident management",
            "service management",
            "reporting",
            "auditability",
            "issues module"
        ],
        "answer_text": "The system will provide an integrated flexible solution for incident and service management and associated reporting. Service management in this context include non-incidents, e.g., an entry for daily security check rounds, or visual inspection of VMS signs, or logging a special event that requires a special lane reversal. All entries require auditability and controls. Incidents can be logged in the new TMaCS via ITSC’s powerful Issues module. New issues can be created using a template with predefined data fields, streamlining the process of adding common or recurring issues into the system. This functionality also lends itself well to creating standardized logs, such as those needed for daily security checks or noting that a visual inspection of the VMS signs was performed. These logs can be automatically sent to chosen emails for record-keeping purposes (in addition to the system’s built-in auditing and issue review features)."
    },
    {
        "look_id": 1055,
        "keywords": [
            "ITS Central",
            "Variable Message Signs",
            "message management",
            "priority ranking",
            "automated messages"
        ],
        "answer_text": "After the integration is complete, ITS Central will manage and operate all existing HHB Variable message signs. This will include posting of messages, scheduled messages, and automated messages. If supported by the hardware’s available API, this will also include monitoring of VMS maintenance issues such as pixel failure. Both manual and automated messages always include a priority ranking. This simplifies the task of the Operator, such that the Operator does not need to decide which message should be posted. The Operator only needs to decide if a message needs to be posted, and what the priority protocol is for that message."
    },
    {
        "look_id": 1056,
        "keywords": [
            "User Interface",
            "reversible lane system",
            "safeguards",
            "operational functions",
            "User Authorization"
        ],
        "answer_text": "The planned User Interface for this 3-lane reversible system will include safeguards and operational functions that include, but are not limited to: User Authorization (or as following HHB protocols) prior to reversal, User Confirmation before beginning sequence, Semi-automated Camera verification (User confirmation that lane is clear), Posting warnings on VMS boards (if part of existing HHB procedures), Flashing Red X sequence for minimum Transition Time (per TAC standards), Solid Red X in two directions for minimum Clearance Time, Alert the Operator if Smartmicro detects that the reversing lane is not yet clear, Operator provides final confirmation that the system is ready for counterflow operation, Post Green Arrow for the reversed lane and change gate state to allow counterflow traffic."
    },
    {
        "look_id": 1057,
        "keywords": [
            "Smartmicro",
            "traffic queue lengths",
            "heavy traffic conditions",
            "TMaCS",
            "sensor integration"
        ],
        "answer_text": "Integration of Smartmicro sensor technologies to build out traffic queue lengths and to alert the TMaCS of heavy traffic conditions and send an associate alert / post message to the VMS sign(s). As part of the Smartmicro radar sensor integration, these sensors will be integrated into ITS Central with semi automation. The project team will work with HHB to establish the logic, thresholds, and scenario messaging associated with events detected by these sensors."
    },
    {
        "look_id": 1058,
        "keywords": [
            "upgrade roadmap",
            "product roadmap",
            "customer feedback",
            "product enhancements"
        ],
        "answer_text": "Our Product Roadmap is led by our senior management, and includes short term, medium term, and long-term product strategic releases, driven by our customer needs and feedback. Over the history of ITS Central’s development, Transnomis has incorporated numerous new features, device integrations, and product enhancements. Product enhancements and roadmaps are driven by customer needs and feedback. We engage our customers through surveys, engagement workshops, training workshops, and allowing for direct suggestions and requests."
    },
    {
        "look_id": 1059,
        "keywords": [
            "quality management",
            "quality control processes",
            "customer requirements",
            "software support issues",
            "documentation"
        ],
        "answer_text": "Transnomis Solutions strives to produce the highest quality software and services to customers through continuous development of our quality management system as well as its consistent implementation. Customers can expect Transnomis Solutions software to meet or exceed their requirements and expectations. We establish Quality Control Processes (QCP) to achieve our quality objectives, namely: Consistently meeting or exceeding customer requirements, Zero/Minimal software support issues, Detailed and accurate documentation."
    },
    {
        "look_id": 1061,
        "keywords": [
            "automated fault detection",
            "issue logging",
            "software reliability",
            "notification system"
        ],
        "answer_text": "Transnomis software is designed to be reliable and responsive. Should any issue be detected in the software, the software itself will automatically notify Transnomis staff. All Transnomis software modules are covered by automated software issue logging and alerts. Should a module fail and/or crash, our software will automatically log it as an issue into the database and will send out a notification email to Transnomis Solutions staff."
    },
    {
        "look_id": 1062,
        "keywords": [
            "emergency updates",
            "service failure",
            "remote resolution",
            "expedited software changes"
        ],
        "answer_text": "In the event of abnormal program shutdown or service failure, support staff will work with HHB IT Staff to remotely resolve the issue by restarting the server, restarting the software, restoring the backup database, and/or restarting the appropriate software module as appropriate. Emergency updates may involve expedited software changes and deployment."
    },
    {
        "look_id": 1063,
        "keywords": [
            "change requests",
            "tracking ticket",
            "software fix",
            "QA development environment"
        ],
        "answer_text": "Software change requests should provide the desired outcome of the change request or feature, as well as the contact information for the submitter, and priority level of the request. For software requests which are within the scope of the project, or if a change order is warranted, the following process will be followed: 1. Transnomis Solutions will generate a tracking ticket for the request. 2. The issue will be reviewed, and a software developer will be assigned to handle the ticket. 3. A software fix will be developed and tested in the QA development environment. 4. A software fix will be pushed to the servers outside of primary operational hours at a time agreed upon with the HHB. 5. The software changes will be documented within the tracking ticket."
    },
    {
        "look_id": 1064,
        "keywords": [
            "ongoing support",
            "maintenance model",
            "preventative maintenance",
            "emergency support"
        ],
        "answer_text": "A formal maintenance plan will be provided that describes the ongoing support maintenance. Some of this plan will be customized based on the specifics of the detailed design. Generally, the maintenance model will include the following elements: Preventative Maintenance, Emergency support / General support."
    },
    {
        "look_id": 1004,
        "keywords": [
            "projects",
            "QSVAS",
            "traffic detection",
            "Smartmicro radar"
        ],
        "answer_text": "Together we have delivered several projects including: Ontario Ministry of Transportation Queue and Stopped Vehicle Advisory System (QSVAS): This project uses 40 Smartmicro radar sensors to detect traffic issues and stopped vehicles along the 8km approach to the border crossing in Niagara Region. After detecting issues, the system automatically posts contextually appropriate messages to one of four VMS."
    },
    {
        "look_id": 1008,
        "keywords": [
            "customizable dashboards",
            "alerts",
            "reports",
            "KPIs"
        ],
        "answer_text": "Our proposed software has a unique feature that allows for user customizable dashboards, to reflect alerts, reports, graphs, cameras, and more. Users can configure multiple dashboards and display them on multiple monitors. Different users can adapt their dashboards to reflect different KPIs or areas of specialization."
    },
    {
        "look_id": 1067,
        "keywords": [
            "SLA",
            "response times",
            "performance measures",
            "uptime"
        ],
        "answer_text": "The SLA will typically involve the following elements: Performance Measures: This proposal and costing are based on 99.9% Uptime outside of scheduled and routine maintenance and server / failover server issues within the scope of HHB’s IT team. Response Times; maximum 1 hour for High Priority Emergency calls, 6 hours for Medium Priority requests, and 24 hours for Low Priority requests."
    },
    {
        "look_id": 1012,
        "keywords": [
            "project kickoff",
            "importance",
            "in-person",
            "HHB facility"
        ],
        "answer_text": "Project kickoff is arguably the most important part of the project as much of the foundation of the project success is laid during this initiation phase of the project. We believe a strong connection between project team members is vital to the success of the project. As such, we propose that the Project Kickoff will be held in person at HHB’s facility."
    },
    {
        "look_id": 1015,
        "keywords": [
            "lane control system",
            "TMaCS",
            "assessment",
            "feedback",
            "third-lane reversals"
        ],
        "answer_text": "We will perform an assessment on the existing lane control system. This includes gathering of the following information (without limitation): Attend both the morning and afternoon third-lane reversals, paying specific attention to how the existing software is operating, recording the process and screen if permitted. Observe and receive feedback from HHB on what the existing system is doing well. Observe and receive feedback from HHB on what can be improved upon in TMaCS."
    },
    {
        "look_id": 1018,
        "keywords": [
            "implementation plan",
            "TMaCS",
            "software development",
            "QA/QC",
            "minimize disruption"
        ],
        "answer_text": "We will develop a detailed plan of how the TMaCS will be implemented – from software development, QA/QC, Training and Go-Live – at a high level. The implementation plan may be a revision of the plan presented in this proposal based on new information obtained in Project Kickoff and Phase 1.0.1. The overarching objective of this plan is to minimize disruption to bridge operation."
    },
    {
        "look_id": 1020,
        "keywords": [
            "data governance",
            "TMaCS",
            "user groups",
            "permissions",
            "data layers"
        ],
        "answer_text": "Based on understanding from the current state evaluation, we will develop a data governance plan, which will include items such as: Users and user groups that should be configured in the system, Permissions of each user groups in the system: who can be permitted to do what, Division of data into separate data layers, Meta data and fields that are needed, A review of existing ITS Central auditing."
    },
    {
        "look_id": 1023,
        "keywords": [
            "PostgreSQL",
            "TimescaleDB",
            "PostGIS",
            "ITS Central",
            "staging VMs"
        ],
        "answer_text": "Our installation and configuration specialist will install and configure the PostgreSQL database (and its required extensions TimescaleDB and PostGIS) as well as the ITS Central web application and its integration gateway modules into the staging VMs. Deliverable: ITS Central database and software installed and configured in Staging VMs."
    },
    {
        "look_id": 1027,
        "keywords": [
            "QA",
            "QC",
            "system performance",
            "issues"
        ],
        "answer_text": "In this phase we will carry out the QA/QC tasks necessary to ensure the system performs as specified with no issues (e.g., crashes, error messages, or performance issues)."
    },
    {
        "look_id": 1031,
        "keywords": [
            "test execution",
            "live traffic",
            "documentation",
            "platform testing",
            "failover testing"
        ],
        "answer_text": "Since some tests will involve live traffic devices, B&M / Transnomis Team proposes to perform the test execution in person at HHB facilities. The test execution will be coordinated with HHB operations staff to minimize impact to the HHB operations and live traffic. Tests will be witnessed by HHB, and test results will be documented and provided to HHB. Tests will include platform testing and failover testing. Deliverable: Test executed and test results documentation."
    },
    {
        "look_id": 1036,
        "keywords": [
            "go-live",
            "user training",
            "documentation",
            "risk mitigation"
        ],
        "answer_text": "In preparation for go live with this phase, we will: Update the user and admin manuals as needed, Provide user training, Reports and dashboard configuration, Create a go-live planning document that minimizes and mitigate risks involved. We anticipate the go-live with this phase will be far more straightforward and less risk than Phase 1.0. Deliverable: Phase 1.1 go live, with updated documentation and training."
    },
    {
        "look_id": 1041,
        "keywords": [
            "documentation",
            "virtual machines",
            "network access",
            "testing"
        ],
        "answer_text": "HHB will be required to handle the following duties: Providing documentation on existing systems, devices, and processes, Provision virtual machines (VMs) for the staging and production instances, Provide secure remote network access for system support and maintenance, Review and provide feedback/answers to inquiries, Assisting Black & McDonald / Transnomis Team as required for VM setup, network access, and software installation, Providing access to the traffic control centre and lane closures, as required for testing."
    },
    {
        "look_id": 1046,
        "keywords": [
            "security framework",
            "compliance",
            "Cyber Secure Canada",
            "certification",
            "security policies"
        ],
        "answer_text": "Provide security framework/compliance alignment, if applicable. Transnomis is currently pursuing the Cyber Secure Canada security certification and expects to achieve certification by Q2 of 2024. Transnomis has policies that apply to all software and hardware at the company and that govern the procedures and security measures that must be followed for any manually updated, or non-updated, software and hardware."
    },
    {
        "look_id": 1049,
        "keywords": [
            "disaster recovery",
            "system reliability",
            "uptime",
            "ITS Central"
        ],
        "answer_text": "Transnomis has built the software from the ground up with a focus on reliability — the uptime goal for all systems we provide is 99.99% excluding routinely scheduled server maintenance. ITS Central is known to operate continuously for months and years without issue."
    },
    {
        "look_id": 1051,
        "keywords": [
            "software expandability",
            "TMaCS processes",
            "modular",
            "customization"
        ],
        "answer_text": "The system will have the adaptability for future changes to TMaCS processes, allowing for expandability in the form of added software features. ITS Central is built in a modular manner. This allows for customization for clients, and new features can be adapted or created for HHB as TMaCS evolves its systems and processes."
    },
    {
        "look_id": 1053,
        "keywords": [
            "ITS Central platform",
            "usability",
            "user-friendly",
            "user requirements",
            "mock-ups",
            "System Demo",
            "Go-Live"
        ],
        "answer_text": "Black & McDonald and Transnomis are proud of the ITS Central platform and its record of usability and satisfied operators. We have built this platform to be stable, user-friendly, and responsive. Great care is taken to ensure that users are satisfied with the product. More importantly, the project leads from Transnomis are former users of operation centre software and will help guide the design process to ensure that the product is built with the user in mind. During the Current State Evaluation project phase, user requirements will be recorded and documented. These user requirements may go beyond the Proposal’s objective requirements, and there will be flexibility to include desired features beyond that of the existing system. Operators may have insight into the existing system, and provide requests such as dark mode dashboards, additional safeguards/verifications, or other features that were not specified in the original RFP. These HHB and HHB operator insights and suggestions will be recorded and tempered against the existing system framework, technical constraints, and practicality, then used as an input during the Implementation phase. Every effort will be used to ensure the system maintains its reputation as being user friendly and easy to learn. The insights and suggestions from that engagement will be used as the basis for later user evaluation. Mock-ups will be shared with HHB and will include 'what we heard' from the engagement session. HHB will be asked to review and ensure that the mock-ups and the 'what we heard' suggestions and insights are reflective of the user’s needs. As the system is being built and implemented, informal demos will be performed, particularly when the Software Project Manager is looking for further input on specific features. A formal System Demo is scheduled after the completion of primary development. This System Demo includes basic training, and a walk through of the features. HHB will be given access to use and test the system and provide feedback. A series of questions will be provided to HHB to survey their opinions on the system, guided by the original input from the engagement and Detailed Design. We have allocated one week for HHB to use the system, ask questions, and provide feedback. The feedback from this System Demo period will be used to guide final changes and system tweaks to ensure the system meets the needs of HHB. During the Go-Live periods, Transnomis staff will be on-hand to observe how HHB operations staff use TMaCS, and take note on any opportunity for improvements. Transnomis staff can directly address any questions and issues immediately. Urgently required changes will be made in an expedited fashion. Most importantly, the project team is highly experienced and have direct hands-on operational experience in traffic management centres and with lane reversal systems, as well as in building software for users."
    },
    {
        "look_id": 1060,
        "keywords": [
            "Continuous Integration",
            "automated testing",
            "GitLab",
            "Jenkins",
            "Selenium"
        ],
        "answer_text": "At Transnomis Solutions, the technical team practices Continuous Integration (CI). Developers merge their code into a shared repository (GitLab) several times a day and the code in each merge is tested using automated testing. The CI process is supported by the use of popular tools like Jenkins, VS Test, Selenium, Nunit and Zalenium."
    },
    {
        "look_id": 1066,
        "keywords": [
            "KPI",
            "SLA",
            "uptime",
            "reliability"
        ],
        "answer_text": "Transnomis has built the software from the ground up with a focus on reliability. We understand that HHB is using this system for safety critical processes and have a reputation of safe and reliable service to its customers. The uptime goal for all systems we provide is 99.9%. This primary KPI is monitored via a third-party Uptime monitoring service."
    },
    {
        "look_id": 1070,
        "keywords": [
            "integrated team",
            "Intelligent Transportation Systems",
            "Municipal Governments",
            "cooperation",
            "teamwork",
            "transparency"
        ],
        "answer_text": "Our integrated team for design/build services of Intelligent Transportation Systems address the unique needs of Municipal Governments and the Ministry of Transportation. Purposeful cooperation, teamwork, alignment of common goals, full transparency and information sharing of risk and rewards ensures mutual success."
    },
    {
        "look_id": 1072,
        "keywords": [
            "Black & McDonald",
            "project management",
            "maintenance agreements",
            "health and safety",
            "environmental compliance",
            "quality assurance"
        ],
        "answer_text": "Black & McDonald Limited manages and takes responsibility for all aspects of projects and maintenance agreements while ensuring a continuity of processes deliverables such as health, safety, environmental compliance, quality assurance, continuous improvement and economies of scale."
    },
    {
        "look_id": 1099,
        "keywords": [
            "Skyway",
            "worker safety",
            "public safety",
            "safety training",
            "traffic control"
        ],
        "answer_text": "Working on the Skyway presents many risks to field crew and public safety. The Skyway is significantly elevated, experiences extreme weather and does not offer any shoulders on either side. It is our top priority to ensure the safety of all project team members and the travelling public when working on this contract. All field crew members will have mandatory safety training refresher courses delivered. No crew member will be permitted to work on the contract without providing proof of training. Daily tailboard safety meetings will be conducted at the yard prior to arrival on-site. Daily meetings will review the work to be conducted, the traffic control plan staging, safety protocols and coordination with vendors or technical support."
    },
    {
        "look_id": 1134,
        "keywords": [
            "raise alerts",
            "adverse weather conditions",
            "configurable time interval"
        ],
        "answer_text": "The Solution shall raise alerts for adverse weather conditions detected within configurable time interval from first identification."
    },
    {
        "look_id": 1068,
        "keywords": [
            "client satisfaction",
            "partnership",
            "added value",
            "exceed expectations"
        ],
        "answer_text": "LEA is committed to the principle that our success is measured in terms of our client's satisfaction and the realization of their social, economic, and environmental objectives. We treat your business as our own by partnering with you on all levels. We look for ways to create added value, to go above and beyond to deliver results that exceed expectations rather than just meet them."
    },
    {
        "look_id": 1069,
        "keywords": [
            "support role",
            "design phase",
            "input",
            "Material Selection Submission"
        ],
        "answer_text": "Globe Network Integrators Inc. will provide a support role during the design phase of this project. Although they are not the designers, they will provide input to the design process based on their experience in other MTO projects. Globe will also develop the Material Selection Submission for the communication network components proposed for use in the project."
    },
    {
        "look_id": 1074,
        "keywords": [
            "Transnomis",
            "ITS Central",
            "Municipal511",
            "Ontario municipalities",
            "OGRA",
            "MACAVO"
        ],
        "answer_text": "Transnomis’ ITS Central also powers the Transnomis Municipal511 web service. Municipal511 serves 45% of Ontario municipalities directly, and numerous public and private stakeholders indirectly through the Ontario Good Roads Association (OGRA) Municipal Alliance for Connected and Autonomous Vehicles in Ontario (MACAVO) initiative."
    },
    {
        "look_id": 1071,
        "keywords": [
            "Transnomis",
            "software control systems",
            "road information management",
            "ITS device communications",
            "ITS Central"
        ],
        "answer_text": "Transnomis has had 14 years of experience building user friendly software control systems for road information management and ITS device communications with its flagship central system software, ITS Central."
    },
    {
        "look_id": 1076,
        "keywords": [
            "GCSS System",
            "vehicle detection",
            "driver warnings",
            "stopped vehicles",
            "queue detection"
        ],
        "answer_text": "The GCSS System must be able to accurately report on the position of stopped or stalled slow queues of vehicles in order to protect exposed drivers stopped in live lanes. A similar situation occurs when vehicle queues are present on the Skyway. Drivers must be warned of as to the location and distance to vehicle queues present issues on the Skyway, in order to prepare to slow down upon entry."
    },
    {
        "look_id": 1137,
        "keywords": [
            "activate VMS",
            "Owner-prescribed messages",
            "condition detected",
            "detection location"
        ],
        "answer_text": "The Solution shall automatically activate the Solution-dedicated VMS in response with appropriate messages based on Owner-prescribed message text, graphics and combined text-graphics templates depending on the condition detected and attributes of the detection location."
    },
    {
        "look_id": 1122,
        "keywords": [
            "manually override",
            "system generated",
            "posted message",
            "VMS"
        ],
        "answer_text": "The Solution shall provide the ability to manually override system generated and posted message on VMS."
    },
    {
        "look_id": 1073,
        "keywords": [
            "B&M",
            "turnkey solutions",
            "ITS infrastructure",
            "traffic engineering",
            "utilities",
            "energy management"
        ],
        "answer_text": "Leveraging our expertise across traffic engineering, utilities, energy management, and mechanical and electrical construction, B&M provides turnkey ITS infrastructure solutions for Municipal, regional and provincial clients."
    },
    {
        "look_id": 1075,
        "keywords": [
            "Safety Advisor System",
            "design",
            "construction",
            "operation",
            "maintenance",
            "System Acceptance Testing"
        ],
        "answer_text": "This project will involve the design, construction, operation and maintenance of a new Safety Advisor System to manage all Eastbound & Westbound lanes of traffic across the expanse of the Skyway. The project will include three phases: System Design, Construction/System and Proof-Of-Performance Testing. Following successful completion of the SIT, System Acceptance Testing for the duration of 8 months will occur. B&M will then be responsible for the operation and maintenance for a duration of 48 months following successful System Acceptance Testing."
    },
    {
        "look_id": 1079,
        "keywords": [
            "detection solution",
            "stopped vehicles",
            "queued vehicles",
            "lane-by-lane",
            "dynamic detection"
        ],
        "answer_text": "B&M understands the detection solution must be capable of identifying isolated stopped vehicles and aggregated queued vehicles on a lane-by-lane basis; as well as dynamic, continuous, and uninterrupted detection with no blind spots."
    },
    {
        "look_id": 1095,
        "keywords": [
            "Project Timelines",
            "Critical Path Method",
            "Microsoft Project",
            "Project Scheduler",
            "Project Manager"
        ],
        "answer_text": "B&M places the utmost importance on the completion of projects on-schedule and on budget. To this end, B&M develops detailed Critical Path Method schedule utilizing latest Microsoft Project. It allows the schedule to be mutually established and easily updated, thus encompassing all of the interrelated requirements, milestones, and final completion dates involved in the completion of the project delivered through an integrated team approach. B&M assigns a dedicated Project Scheduler for every project who is primarily responsible for supporting the Project Manager in scheduling activities including-creating baseline schedules, updating schedules on a weekly or bimonthly basis to incorporate change orders, identifying and monitoring the Critical Path and escalating any anticipated delays to the Project Manager."
    },
    {
        "look_id": 1123,
        "keywords": [
            "VMS",
            "messages",
            "configuration",
            "traffic conditions",
            "collaboration"
        ],
        "answer_text": "The Solution shall be capable of automatically activating VMS to display messages according to the following rules and shall be configurable to adapt to modifications of these rules: Messages shall indicate actual lane configuration and affected lanes at queue end or isolated stopped vehicle location, as applicable, at any point within the System Limits, to address specific conditions and correlated messages. Messages shall distinguish between slow and stopped traffic at the queue end, based on user-configurable system parameters. Messages shall indicate approximate distance to downstream queue end or isolated stopped vehicle, as applicable, based on ranges defined as user-configurable system parameters. The Vendor shall work in collaboration with the Owner to determine any modifications required to the above rules."
    },
    {
        "look_id": 1081,
        "keywords": [
            "operational support",
            "maintenance",
            "four-year term",
            "decommissioning",
            "MTO confirmation"
        ],
        "answer_text": "B&M will maintain and provide operational support for the GCSS System over a four-year term. Upon completion of the operational support and maintenance period, B&M will decommission the GCSS System upon confirmation from the MTO."
    },
    {
        "look_id": 1083,
        "keywords": [
            "triple redundancy",
            "server",
            "high availability",
            "streaming replication",
            "wireless backup"
        ],
        "answer_text": "Triple Redundancy Server & Comms: Primary server with a secondary server (hot standby) and tertiary server (cold standby), complete with streaming replication, and wireless backup communications to all three servers. This provides high availability of the system, and onsite backups."
    },
    {
        "look_id": 1096,
        "keywords": [
            "Quality Assurance",
            "Quality Control",
            "Quality Management",
            "efficiencies",
            "project costs",
            "training",
            "ITS infrastructure",
            "MTO infrastructure"
        ],
        "answer_text": "B&M has in place a Quality Assurance / Quality Control Policy and Program that will adhere to the principles and objectives of our client’s Quality Management requirements. Our Program has been developed to meet, and through continuous review and improvement, exceed our client’s QA requirements. B&M’s Program focus is on increasing efficiencies and reducing project costs while maintaining the highest level of quality in all work completed. B&M ensures quality work by improving and maintaining our workforce knowledge through training session, seminars access to educational resources and IMSA certification courses. The B&M management team and field crews specified for this contract are well educated in ITS infrastructure and have specific knowledge of MTO infrastructure and procedures. We have proven the effectiveness of our services on other projects/maintenance contracts and there are no back charges associated with our services."
    },
    {
        "look_id": 1109,
        "keywords": [
            "forward looking principle",
            "accuracy",
            "traffic volume",
            "individual speed measurements"
        ],
        "answer_text": "Due to the forward looking principle, the sensor provides significant higher levels of accuracy compared to other traffic monitoring equipment. Traffic volume measurements are greater than 98% accurate and individual speed measurements are accurate to within +/- 0.28 m/s (1%)."
    },
    {
        "look_id": 1077,
        "keywords": [
            "safety",
            "accuracy",
            "uptime",
            "redundancy",
            "fail-safe features"
        ],
        "answer_text": "As safety is the top priority for B&M and the primary objective for the GCSS System, it is critical that the GCSS System operates and reports the required information with the highest possible accuracy and uptime. It is our objective to design a system which promotes redundancy and fail-safe features to ensure consistent operation is maintained."
    },
    {
        "look_id": 1078,
        "keywords": [
            "electronic ticketing system",
            "fault tracking",
            "maintenance",
            "safety procedures"
        ],
        "answer_text": "The project team will implement an electronic ticketing system to ensure system faults are tracked and resolved within the contract timeframes specified in the contract documents. Crews will comply with all safety procedures while conducting maintenance activities."
    },
    {
        "look_id": 1080,
        "keywords": [
            "software solution",
            "continuous operation",
            "automatically generate alerts",
            "stopped vehicles",
            "queue"
        ],
        "answer_text": "The software solution must be designed to have continuous operation. It must automatically generate and clear alerts for a queue or stopped vehicles detected without operator intervention."
    },
    {
        "look_id": 1082,
        "keywords": [
            "innovative approaches",
            "radar test site",
            "sensor integration",
            "validate data",
            "traffic sensor data"
        ],
        "answer_text": "Our Project Team’s proposal and fees includes the following innovative approaches, above the provided specifications: A radar test site will be installed on the project site, to facilitate sensor integration, validate data, and allow for early evaluation of site-specific traffic sensor data."
    },
    {
        "look_id": 1112,
        "keywords": [
            "Environmental project",
            "consultation program",
            "technical deliverables",
            "MTO Class EA process"
        ],
        "answer_text": "The Environmental project scope of work includes the development and implementation of a consultation program, coordination of technical specialist to investigate and characterize existing site conditions, evaluate project related impacts, develop protection strategies and mitigation measures and to produce required technical deliverables to satisfy the requirements and ensure compliance with the MTO Class EA process."
    },
    {
        "look_id": 1084,
        "keywords": [
            "Smartmicro Radar",
            "test site",
            "sensor data",
            "data interpretation",
            "remote data validation",
            "safety concerns",
            "system testing"
        ],
        "answer_text": "The project team will install a Smartmicro Radar test site on the Garden City Skyway. The test site will provide sensor data to Transnomis Solutions such that any issues related to data interpretation will be detected and rectified early in the contract. The proposed sensor for the test site will include video and radar integration. This will allow for remote data validation. Any issues related to sensor position, height or alignment will be detected early, providing the team with the opportunity to rectify the test site before installing other sensors. Due to the safety concerns associated with working on the Skyway, it is important that sensor installations are completed efficiently and in a timely manner. The test site will allow future sensor installations to be completed with reliability such that field crews will not need to return to make adjustments. Regular system testing will allow the team to discover and solve previously unknown issues, provide Transnomis a head start on software development and refine the project teams testing procedure for the remaining sensors. A sensor test site will be installed early into the contract for system testing and discovery. We believe this approach helped lead to the success of the QSVAS project."
    },
    {
        "look_id": 1086,
        "keywords": [
            "GCSS System",
            "high availability",
            "server setup",
            "24/7 operation",
            "failover"
        ],
        "answer_text": "Our GCSS System solution will incorporate the following high availability features designed specifically for the QSVAS for 24/7 non-stop operation: Triple server setup in 3 separate cabinets: Primary server; Secondary server setup with streaming replication with the primary server and automatic failover should the primary server fails; and Third server setup with streaming replication with the primary server as cold standby server ready to take over as 'Secondary Server' should one of the above servers fails."
    },
    {
        "look_id": 1087,
        "keywords": [
            "fibers",
            "interconnected",
            "safety messages",
            "server downtime",
            "MTO Operators",
            "dashboard"
        ],
        "answer_text": "A second opportunity for an innovative approach is to assign fibers 21 to 24 continuously through the network, so that the GCSS and QSVAS segments can be interconnected. This would allow safety messages and warnings to be shared between both systems, increasing its utility for the MTO. It would also reduce the risk of server downtime, as the servers could be shared between both systems. Finally, this approach would allow the MTO Operators to access both systems through one dashboard."
    },
    {
        "look_id": 1113,
        "keywords": [
            "fish habitat",
            "terrestrial ecosystem",
            "field investigations",
            "MTO guidelines"
        ],
        "answer_text": "Appropriate fish and fish habitat and terrestrial ecosystem field investigations will be undertaken as per requirements of the MTO/DFO/MNRF Fisheries Protocol (2020) and the MTO Environmental Reference for Highway Design (ERD) to ensure constraints and sensitives are identified and appropriately incorporated into the project planning and design processes."
    },
    {
        "look_id": 1089,
        "keywords": [
            "Afra Shokraei",
            "Project Sponsor",
            "ITS Department Manager",
            "Black & McDonald",
            "construction management",
            "project management"
        ],
        "answer_text": "Afra Shokraei is the ITS Department Manager for Black & McDonald, and will serve as the Project Sponsor for the duration of the project. As a PMP and Professional Electronic Engineer, Afra has over 15 years of experience in the ITS field. Afra has developed a keen understanding of construction management, project management, and the business development of ITS projects. Afra has had significant involvement in P3 and major projects incorporating new ITS technologies and systems, including: Speed enforcement systems, central and ATMS systems, toll systems, dynamic message signs, intersection management and adaptive traffic control systems."
    },
    {
        "look_id": 1090,
        "keywords": [
            "Simon Foo",
            "CEO",
            "Transnomis Solutions",
            "ITS Central Software Solution",
            "software architecture",
            "TMC operations"
        ],
        "answer_text": "Simon is the owner, founder, and CEO of Transnomis Solutions. He has degrees in Computer, Electrical, and Civil Engineering, and solid experience in TMC operations, and ITS device integration. Simon personally architected and developed the ITS Central Software Solution, proposed for this project. Simon will lead the GCSS Software Technical Solution and oversee the architecture and design. Simon will be the primary contact for Transnomis."
    },
    {
        "look_id": 1091,
        "keywords": [
            "Yeatland Wong",
            "Project Delivery Lead",
            "Transnomis Solutions",
            "software delivery",
            "project management",
            "ITS",
            "TMC systems"
        ],
        "answer_text": "Yeatland will lead the delivery of the software product on behalf Transnomis Solution, working closely to support Simon Foo. He will also ensure the software is delivered according to schedule, and will lead software stakeholder workshops and training sessions. Yeatland will also oversee the staff responsible for software testing, automation testing, and documentation. He has 20+ years of experience in project management, planning, implementation, testing and operation of ITS and TMC systems."
    },
    {
        "look_id": 1124,
        "keywords": [
            "VMS",
            "enable",
            "disable",
            "operation"
        ],
        "answer_text": "The Solution shall provide the capability to disable and enable each VMS individually for operation."
    },
    {
        "look_id": 1085,
        "keywords": [
            "firewall",
            "network isolation",
            "MTO",
            "security",
            "downtime",
            "redundant connections"
        ],
        "answer_text": "A full firewall is provided in the network to completely isolate the proposed network from the MTO’s existing network. This firewall will be the demarcation point between the new project and the MTO, and provide a Layer 3 interface that can be configured for a high degree of security. This approach allows the MTO to connect to the new system, while keeping the two networks completely isolated. The use of this demarcation to the MTO’s network minimizes downtime by using the MTO’s redundant ring connections to the CRCTMC."
    },
    {
        "look_id": 1114,
        "keywords": [
            "MTO Class EA process",
            "technical reports",
            "Environmental Screening Document"
        ],
        "answer_text": "The execution of the MTO Class EA process will be formally documented with the production of technical discipline specific reports as required and within an Environmental Screening Document (ESD)."
    },
    {
        "look_id": 1093,
        "keywords": [
            "Senior Highway Engineer",
            "Transportation Engineer",
            "planning",
            "design",
            "project management",
            "municipal roads",
            "highways",
            "bridges"
        ],
        "answer_text": "Ravie Erathasari is a Senior Highway Engineer at LEA Consulting Ltd. With more than 24 years of Canadian and International experience as a Transportation Engineer Ravie’s experience includes 16 years in planning, design and project management of municipal roads, highways and bridges and 8 years in construction project management. His main expertise lies in preliminary and detail design including preparation of Preliminary Design Reports, Contract Documents and Drawings, Coordination with project stakeholders and multi-disciplinary project teams in delivering the projects on schedule."
    },
    {
        "look_id": 1094,
        "keywords": [
            "Lead Electrical Engineer",
            "Electrical Engineering team",
            "traffic signals",
            "lighting",
            "power distribution design"
        ],
        "answer_text": "Mary Hawker will serve as Lead Electrical Engineer overseeing all work performed by the Electrical Engineering team, direct the electrical engineering design, check and stamp the electrical engineering work, attend all project meetings. Mary is Manager of Traffic Signals, Lighting and Electrical Sub-systems with LEA. Backed by over 30 years of experience; Mary provides expertise in the areas of traffic signal control systems, illumination, and power distribution design."
    },
    {
        "look_id": 1125,
        "keywords": [
            "collaboration",
            "requirements",
            "Vendor",
            "Owner"
        ],
        "answer_text": "The Vendor shall work in collaboration with the Owner to finalize details of all requirements in this section."
    },
    {
        "look_id": 1088,
        "keywords": [
            "Alicia Turner",
            "Project Manager",
            "construction",
            "utilities",
            "MTO",
            "Black & McDonald"
        ],
        "answer_text": "Alicia Turner is a knowledgeable industry professional with over 10 years of experience in construction and utilities. She is working within the MTO/Municipal division in Black & McDonald under Utilities Region. She started in Black & McDonald as Project Coordinator and Estimator and later moved on to work as a Project Manager. She has worked on several significant projects such as MTO QSVAS: She worked Project Manager 405."
    },
    {
        "look_id": 1115,
        "keywords": [
            "project schedule",
            "consultation engagement",
            "Transport Canada",
            "Niagara District Airport"
        ],
        "answer_text": "To ensure the project schedule can be maintained, consultation engagement with Transport Canada – Navigation Protection Program, Niagara District Airport and the St. Lawrence Seaway Management Corporation will be undertaken immediately after project award."
    },
    {
        "look_id": 1092,
        "keywords": [
            "Design Team Project Manager",
            "ATMS Lead Engineer",
            "management",
            "coordination",
            "ITS project design",
            "RAQS-approved"
        ],
        "answer_text": "Stanley Hung will be a Design Team Project Manager/ATMS Lead Engineer for this project and will be responsible for the management and coordination of design work and project team members for work assignments. Stanley has over 19 years of direct ITS project design and management experience. He is a RAQS-approved key person for Electronic Subsystem Design, Construction Contract Administration, and Specialized Inspection Services, as well as for ATMS Product, Process and Strategic Development."
    },
    {
        "look_id": 1097,
        "keywords": [
            "comprehensive testing",
            "Technical Specification",
            "MTO Testing",
            "Test plan",
            "test results"
        ],
        "answer_text": "The project will undergo comprehensive testing, following the process described in Technical Specification Paragraph 2.6, and in adherence with standard MTO Testing as described in Special Provision 168F14. A formal Test plan will be prepared and submitted for review and approval that will document the tests to be performed and the expected results. The OE and MTO will be invited to all testing as witnesses, and test results will be documented and submitted at the completion of all tests."
    },
    {
        "look_id": 1117,
        "keywords": [
            "structural engineering",
            "VMS support structures",
            "Garden City Skyway"
        ],
        "answer_text": "The structural engineering scope of work involves the design of two (2) non-standard single centre-mounted Variable Message Sign (VMS) support structures adjacent to the Garden City Skyway."
    },
    {
        "look_id": 1101,
        "keywords": [
            "Black & McDonald",
            "Intelligent Transportation System",
            "quality",
            "expertise",
            "installation",
            "construction"
        ],
        "answer_text": "Black & McDonald is acutely aware of the steps, resources and expertise required to install, construct, maintain and deliver a fully functional Intelligent Transportation System, which adheres to the Owner’s requirements. Our manpower is constantly working on new ITS contracts and keeping their knowledge up to date on the latest industry technologies. As a result, our services are efficient, safe, and of the highest quality."
    },
    {
        "look_id": 1102,
        "keywords": [
            "partnerships",
            "Smartmicro",
            "sensor projects",
            "preferential pricing",
            "expedited orders"
        ],
        "answer_text": "B&M maintains strong relationships and exclusive partnerships with ITS technology vendors. Due to our large volumes of work, we garner preferential pricing and expedited orders. Under our exclusive partnership with Smartmicro, we have delivered numerous sensor projects ranging from corridor based adaptive to highway statistics gathering."
    },
    {
        "look_id": 1100,
        "keywords": [
            "ITS Central",
            "event management system",
            "traffic sensors",
            "CCTV",
            "VMS",
            "Windows Server",
            "PostgreSQL"
        ],
        "answer_text": "Transnomis’ ITS Central with custom modules and configurations is proposed to be the GCSS Central Software. Transnomis’ ITS Central is a versatile map-centric event management system capable of integrating traffic sensors, CCTV, VMS, as well as a large number of internal data sources and external open data sources. It runs on any off-the-shelf Windows Server - hardware or virtual machine. The web front end uses Internet Information Services (IIS) with Model-View-Controller (MVC) technologies where data is stored in a high performance, open-source relational database PostgreSQL."
    },
    {
        "look_id": 1103,
        "keywords": [
            "training",
            "ITS technology",
            "occupational health and safety",
            "field personnel"
        ],
        "answer_text": "In order to stay updated on the latest ITS technology, industry standards and occupational health and safety, Black & McDonald schedules regular training session for man power and field personnel."
    },
    {
        "look_id": 1105,
        "keywords": [
            "GCSS Central Software",
            "ITS Central",
            "web-based",
            "monitoring",
            "controlling",
            "software modules"
        ],
        "answer_text": "The proposed GCSS Central Software will have the following architecture: ITS Central is a user-friendly, web-based central control system, designed for monitoring and controlling intelligent transportation system (ITS) technologies. ITS Central already has off-the-shelf software modules that will interface with all of the devices, although some updates and customization are expected."
    },
    {
        "look_id": 1104,
        "keywords": [
            "Mean Time Between Failure",
            "MBTF",
            "operating temperature range",
            "Ethernet Switches",
            "MTO Specification"
        ],
        "answer_text": "With a Mean Time Between Failure (MBTF) of 44.5 years, this unit is intended to be deployed and left in place with minimal maintenance. It also has an operating temperature range of -20°C to +60°C, which exceeds the requirements for Ethernet Switches in MTO Specification 683S25."
    },
    {
        "look_id": 1107,
        "keywords": [
            "uninterrupted detection",
            "no blind spots",
            "continuous traffic detection"
        ],
        "answer_text": "The proposed sensor design includes uninterrupted detection coverage for both directs with no detection blind spots throughout the limits of project. Detect traffic in all lanes continuously within the limits of detection."
    },
    {
        "look_id": 1141,
        "keywords": [
            "pre-configured messages",
            "manual posting",
            "VMS",
            "ITS Central"
        ],
        "answer_text": "The Solution shall provide the ability to manually set pre-configured messages on signs outside of a detected alert, in the event of a detection device failure or when autonomous mode has been disabled. The Vendor shall work in collaboration with the Owner to determine the pre-configured messages. ITS Central allows operators to manually post messages to signs by selecting a message from a message library."
    },
    {
        "look_id": 1158,
        "keywords": [
            "dashboard",
            "weather data",
            "user-configurable",
            "collaboration",
            "customizable"
        ],
        "answer_text": "ITS Central provides a flexible and user-configurable dashboard display. The content of the dashboard is easily configurable to a user’s preference or to be displayed on large or multiple monitors. A combination of maps, camera images (from Ontario 511), lists, charts and graphs may be customized and arranged on a dashboard display. Therefore, all the weather data listed will be available in graphic, chart or tabular format in ITS Central’s dashboard. The Project Team will collaborate with the Owner to arrange the dashboard view of the weather data to their preference, which will include all of the weather data stipulated in this requirement."
    },
    {
        "look_id": 1106,
        "keywords": [
            "Smartmicro UMRR-12",
            "Type 48 radar",
            "traffic sensor solution",
            "multi-lane",
            "object tracking",
            "Ultra High Definition"
        ],
        "answer_text": "The Smartmicro UMRR-12 Type 48 radar is the proposed traffic sensor solution to monitor and report isolated stopped vehicles or vehicle queues. The Type 48 radar is a 24 GHz, forward firing radar sensor used for multi-lane, multi-object tracking traffic management applications. The Type 48 sensor features innovative 4D – Ultra High Definition (UHD) object tracking technology."
    },
    {
        "look_id": 1108,
        "keywords": [
            "presence detection accuracy",
            "stopped vehicles",
            "five seconds"
        ],
        "answer_text": "Type 48 radar provides presence detection accuracy of greater than 95 percent. Detect stopped vehicles within a maximum of five seconds of their occurrence on the roadway."
    },
    {
        "look_id": 1111,
        "keywords": [
            "temperature interval",
            "Canadian climate",
            "IP 67 rated enclosure",
            "water and dust immunity"
        ],
        "answer_text": "The sensor operates in a wide temperature interval between -40 to +74 degrees Celsius, suitable for the Canadian climate. The sensor is housed within an IP 67 rated enclosure, immune to the ingress of water or dust infiltration."
    },
    {
        "look_id": 1110,
        "keywords": [
            "weather immunity",
            "harsh climates",
            "reliability",
            "robust sensing technology"
        ],
        "answer_text": "Smartmicro sensors are deployed globally, operating in the world's harshest climates. From the deserts of Dubai to Northern Russia, Smartmicro sensors detect reliability 24/7. Radar is the most robust sensing technology and is not affected by dirt, smog, sunlight, wind, rain or snow."
    },
    {
        "look_id": 1119,
        "keywords": [
            "environmental sampling program",
            "MECP sampling protocols",
            "analytical testing",
            "corrosivity package test",
            "toxicity characteristic leaching procedure"
        ],
        "answer_text": "The proposed environmental sampling program will be conducted in general accordance with MECP sampling protocols, as described in the MECP document “Guide for Completing Phase Two ESAs under O. Reg. 153/04,” dated June 2011 and in the MECP document “Protocol for Analytical Methods Used in the Assessment of Properties under Part XV.1 of the Environmental Protection Act,” dated March 9, 2004, amended as of July 1, 2011 (Analytical Protocol). The RFP document does not specify any analytical testing to be performed on the collected soil samples. However, the following testing is proposed to support the disposal of the excess spoil material generated from drilling activities and in anticipation of the design and construction requirements for the VMS and CCTV concrete pole foundation elements: Corrosivity package test on three (3) selected soil samples (one per borehole); and One composite soil sample to be submitted for toxicity characteristic leaching procedure (TCLP) analysis."
    },
    {
        "look_id": 1120,
        "keywords": [
            "adverse weather",
            "alerts",
            "configurable time interval",
            "Design stage",
            "collaboration"
        ],
        "answer_text": "The Solution shall raise alerts for adverse weather conditions detected within configurable time interval from first identification. During the Design stage, the successful vendor shall work in collaboration with the Owner to determine a configurable range for the time interval."
    },
    {
        "look_id": 1210,
        "keywords": [
            "Ajay Kaushik",
            "Overall Project Manager",
            "responsibility",
            "qualifications",
            "experience",
            "software development",
            "project management"
        ],
        "answer_text": "Ajay Kaushik, Senior Director of Technology at Stinson ITS, will assume overall responsibility for the project from Stinson ITS and Transnomis. After completing his degree in engineering from Pune University (one of India’s top universities), Ajay started his career in 2003 as a software developer and has since played multiple roles as software architect, project manager, and solution architect in his 20 years of experience. He has completed his Six Sigma Black Belt Certification, Project Management Professional PMP, and CSM. He has also completed his MBA from Manchester Business School in 2016. In the past 5 years, Ajay has led design and project management for multiple software projects at Stinson ITS and his previous organizations. His background in software development, DevSecOps, hands-on expertise, and project management experience will help us in not just installing and managing multiple instances of the software for the platform but also during integrations with multiple systems using REST APIs or ETL tools. He will be responsible to ensure that the requirements for user interface, API interfaces, use cases, test cases, and deployment schedules are properly documented and approved by GNWT, before they are implemented in the software."
    },
    {
        "look_id": 1212,
        "keywords": [
            "Michael McGuire",
            "Project Administrator",
            "qualifications",
            "experience",
            "ITS solutions",
            "project management"
        ],
        "answer_text": "Michael has a diverse technology background with experience across many disciplines including networking, automated control systems, wireless communications, and Intelligent Transportation Systems. He is responsible for managing all aspects of day-to-day business at Stinson ITS including people management, partnership management, project leadership, customer liaison, system design, and issue supervision. He has designed and delivered multiple ITS solutions to municipalities, provinces and territories in Canada including intelligent count stations, school-zone flasher control systems, corridor management systems, travel time systems, work-zone systems, near-miss safety analytics systems, variable speed limit systems, over-height warning systems, emergency vehicles preemption and transit signal priority systems, and specialized VMS systems."
    },
    {
        "look_id": 1121,
        "keywords": [
            "automatically activate",
            "VMS",
            "Owner-prescribed messages",
            "Design stage",
            "collaboration",
            "Concept of Operations"
        ],
        "answer_text": "The Solution shall automatically activate the Solution-dedicated VMS in response with appropriate messages based on Owner-prescribed message text, graphics, and combined text-graphics templates depending on the condition detected and attributes of the detection location. During the Design stage, the successful vendor shall work in collaboration with the Owner to complete and finalize all VMS messages to comply with and be consistent with the Concept of Operations, to the satisfaction of the Owner."
    },
    {
        "look_id": 1145,
        "keywords": [
            "disable",
            "enable",
            "VMS",
            "ITS Central",
            "management type"
        ],
        "answer_text": "The Solution shall provide the capability to disable and enable each VMS individually for operation. VMS’s may be disabled and enabled individually and globally within ITS Central. ITS Central allows users to disable and enable the VMS individually by updating the 'management type' of the VMS configuration."
    },
    {
        "look_id": 1126,
        "keywords": [
            "calendar database",
            "ambient light",
            "sunset",
            "sunrise",
            "time-based information"
        ],
        "answer_text": "The Solution shall be capable of storing and retrieving data from a calendar database to determine ambient light conditions (approximate sunset & sunrise timings) throughout the GCSS System specific to each day of the year. The Solution shall be capable of retrieving information on weekdays/weekend days, holidays, seasons and other time/date-based information from the calendar database."
    },
    {
        "look_id": 1148,
        "keywords": [
            "error cause",
            "VMS",
            "communication failure",
            "recorded"
        ],
        "answer_text": "The Solution shall provide cause of error or failure experienced by VMS, as reported by controller or as generated by the Solution in the event of a communication failure. Any VMS issues, including communication failure or short error status, are recorded in the system."
    },
    {
        "look_id": 1150,
        "keywords": [
            "collaboration",
            "Owner",
            "requirements",
            "finalization"
        ],
        "answer_text": "The Vendor shall work in collaboration with the Owner to finalize details of all requirements in this section. We will work with the Owner and Owner Engineer to finalize details of the requirements in this section."
    },
    {
        "look_id": 1127,
        "keywords": [
            "collaboration",
            "user interface",
            "ergonomic needs",
            "Owner"
        ],
        "answer_text": "The Vendor shall collaborate with the Owner to determine the final display of the user interface and for confirmation that the human factors and ergonomic needs have been addressed to the satisfaction of the Owner."
    },
    {
        "look_id": 1129,
        "keywords": [
            "administration",
            "configuration",
            "VMS Devices",
            "Traffic Detection",
            "Weather Detection",
            "event alerts",
            "roadway geometry"
        ],
        "answer_text": "The Vendor shall administer the configuration of the following throughout the lifecycle of the System: VMS Devices, Traffic and Weather Detection Devices, Decision support rules and templates for automated response to event alerts, All parameters and thresholds associated with calibrating the algorithm for detecting event alerts, Mapping basis for Solution to include long-term and temporary modifications in roadway geometry."
    },
    {
        "look_id": 1130,
        "keywords": [
            "weather detection",
            "real-time data",
            "adverse weather conditions",
            "air temperature",
            "humidity",
            "air pressure",
            "precipitation",
            "wind speed",
            "visibility"
        ],
        "answer_text": "The Solution shall use weather detection equipment as a source of data for determining weather conditions for detecting weather alerts within the System Limits. The Solution shall be capable of detecting the air temperature, humidity, air pressure, precipitation type, precipitation intensity, precipitation quantity, sustained wind speed and wind gusts, wind direction, visibility, pavement temperature, and subsurface pavement conditions. ITS Central will integrate directly with all-weather detection equipment identified in the RFP to collect responsive real-time data to determine adverse weather conditions."
    },
    {
        "look_id": 1152,
        "keywords": [
            "browser-based",
            "thin-client",
            "Google Chrome",
            "Microsoft Edge"
        ],
        "answer_text": "ITS Central is designed for browser-based thin clients and supports the named browsers and versions."
    },
    {
        "look_id": 1154,
        "keywords": [
            "responsive",
            "user interface",
            "data entry",
            "lag"
        ],
        "answer_text": "ITS Central has a highly responsive user interface; ITS Central generally refreshes the map or other user interfaces within one second or less."
    },
    {
        "look_id": 1211,
        "keywords": [
            "Yeatland Wong",
            "Technical Project Manager",
            "qualifications",
            "experience",
            "ITS systems",
            "transportation technology"
        ],
        "answer_text": "Yeatland Wong, P.Eng., is the Director of Smart Mobility Project Delivery for Transnomis Solutions Inc. Yeatland’s career includes 15 years of service with the City of Calgary, which included roles such as the ATMS Engineer, where he worked closely with the Traffic Management Centre, and later as Senior Intelligent Transportation Systems (ITS) Engineer where he oversaw the successful implementation of many advanced transportation technology and software projects while running the City’s $1M/year ITS Program. Yeatland has worked extensively on a broad range of advanced technology projects, from lane reversal systems to connected and automated vehicles. His experience in ITS systems is backed by solid experience in TMC operations, traffic signal operations, traffic engineering design and transportation planning."
    },
    {
        "look_id": 1131,
        "keywords": [
            "weather detection",
            "adverse weather alerts",
            "VMS responses",
            "data processing",
            "Vendor collaboration"
        ],
        "answer_text": "The Solution shall collect the weather detection data on an ongoing basis and integrate and otherwise process the source data as needed to generate adverse weather alerts that align directly with the VMS responses included in the Core Message Set weather messages in Core Message Set for GSCC System – Dedicated VMS document supplied by the Ministry, and other similar messages to be determined during the Design stage through Vendor collaboration with the Owner."
    },
    {
        "look_id": 1156,
        "keywords": [
            "AODA",
            "WCAG 2.0",
            "accessibility"
        ],
        "answer_text": "ITS Central complies with AODA and WCAG 2.0."
    },
    {
        "look_id": 1213,
        "keywords": [
            "project administrator",
            "technical expertise",
            "software architecture",
            "ATMS software",
            "GNWT integration",
            "on-budget",
            "on-schedule"
        ],
        "answer_text": "Simon will not only act as a project administrator on behalf of Transnomis but also provide technical expertise and guidance to ensure that the project’s software architecture is built to the highest possible standard. His deep, two decades of experience in building ATMS software and managing multiple instances of the software across different projects will be critical in success of this project. Simon also has a deep understanding of the software used by GNWT for integration with traffic data, cameras, thermistors, weather information systems, ferry tracking systems, NTCIP standards (used for variable message board and other communications), GIS systems, and more. Over his 20+ years of experience, he has integrated hundreds of systems. This knowledge will be critical to ensuring an on-budget and on-schedule completion of this project."
    },
    {
        "look_id": 1215,
        "keywords": [
            "sales background",
            "traffic industry",
            "IMSA",
            "traffic counting devices",
            "Intelligent Warning Systems",
            "Pedestrian Crosswalk Solutions"
        ],
        "answer_text": "Sheri has an extensive background in sales and has worked in the traffic industry for over 12 years. She is a member in good standing of IMSA and has Work Zone Traffic Control Safety and Traffic Signal Technician Level 1 & 2 Certification. She is working with a suite of products that include traffic counting devices, intersection detection products, Intelligent Warning Systems, Pedestrian Crosswalk Solutions and Speed Zone Awareness Solutions."
    },
    {
        "look_id": 1222,
        "keywords": [
            "quality assurance",
            "quality management system",
            "Quality Control Processes",
            "customer requirements",
            "documentation"
        ],
        "answer_text": "Transnomis Solutions strives to produce the highest quality software and services to customers through continuous development of our quality management system as well as its consistent implementation. The GNWT can expect Transnomis Solutions software to meet or exceed their requirements and expectations. We establish Quality Control Processes (QCP) to achieve our quality objectives, namely: Consistently meeting or exceeding customer requirements, Zero/Minimal software support issues, Detailed and accurate documentation."
    },
    {
        "look_id": 1132,
        "keywords": [
            "weather detection",
            "adverse weather alerts",
            "VMS responses",
            "Core Message Set"
        ],
        "answer_text": "The Solution shall collect the weather detection data on an ongoing basis and integrate and otherwise process the source data as needed to generate adverse weather alerts that align directly with the VMS responses included in the Core Message Set weather messages in Core Message Set for GSCC System."
    },
    {
        "look_id": 1133,
        "keywords": [
            "Project Team",
            "Owner",
            "finalize alerts",
            "VMS messages"
        ],
        "answer_text": "The Project Team will work with the Owner to finalize the alerts and VMS messages, as we have done with the LVWS and QSVAS."
    },
    {
        "look_id": 1159,
        "keywords": [
            "dashboard creation",
            "flexibility",
            "collaboration",
            "traffic data",
            "weather data"
        ],
        "answer_text": "The ITS Central dashboard creation tool is flexible. The Project Team will work with the Owner to configure new dashboards based on any weather and traffic data to the Owner’s satisfaction, as we have done for the QSVAS."
    },
    {
        "look_id": 1135,
        "keywords": [
            "Design stage",
            "successful vendor",
            "collaboration",
            "configurable range"
        ],
        "answer_text": "During the Design stage, the successful vendor shall work in collaboration with the Owner to determine a configurable range for the time interval."
    },
    {
        "look_id": 1136,
        "keywords": [
            "integrate data",
            "weather conditions detectors",
            "weather detection devices"
        ],
        "answer_text": "The Solution shall integrate the data collected from several different types of weather conditions detectors and multiple weather detection devices."
    },
    {
        "look_id": 1138,
        "keywords": [
            "persistence check",
            "stable event",
            "VMS",
            "message display",
            "ITS Central"
        ],
        "answer_text": "The Solution shall perform a persistence check to confirm a “stable event”, so as not to have the VMS display change messages rapidly. The Solution shall implement a minimum time between changing of messages. ITS Central incorporates two types of persistence checks. The first persistence check is at the issue creation level – an issue is not generated unless it has been stable for longer than the configured time. The second persistence check is at the VMS level – messages posted automatically to the VMS will persist for the minimum configured time – to prevent messages from changing rapidly."
    },
    {
        "look_id": 1139,
        "keywords": [
            "reject alert",
            "false alarm",
            "VMS",
            "ITS Central",
            "message removal"
        ],
        "answer_text": "The Solution shall provide the ability to reject a detected alert, which would automatically remove the messages posted or changes in state on applicable VMS. When an issue has been created in ITS Central for QSVAS, it will automatically activate the required VMS signs. If a user determines that the detected issue is a false alarm, they may change the issue status by clicking the Declare False Alarm option. This will update the status of the issue to “False Alarm”, which will automatically remove any related posted messages."
    },
    {
        "look_id": 1140,
        "keywords": [
            "manual override",
            "VMS messages",
            "urgent messages",
            "ITS Central"
        ],
        "answer_text": "The Solution shall provide the ability to manually override system generated and posted messages on VMS. In ITS Central, VMS messaging may be manually overridden and messages may be replaced in the following ways on a sign-by-sign basis: A VMS may be manually “blanked.” A manual message may be posted immediately to a particular sign. This option is best for posting urgent messages (e.g., border closures, AMBER alerts) as it involves the fewest steps. Note that this will also disable automated messaging for that sign."
    },
    {
        "look_id": 1161,
        "keywords": [
            "flashing",
            "video wall",
            "alert status",
            "equipment status"
        ],
        "answer_text": "The Solution shall provide capability for flashing of elements of the video wall user interface, including large coloured border (i.e., thick screen frame, background space, portions of frame/background), and event and equipment icons (individually or in groups), to indicate changes in alert status of any or all events, and changes in fault status of any or all equipment components."
    },
    {
        "look_id": 1163,
        "keywords": [
            "historical data",
            "collaboration",
            "Owner",
            "access methods"
        ],
        "answer_text": "The Project Team will work with the Owner to determine the best approach, given the users’ needs, for providing the system’s historical data outside of the GUI."
    },
    {
        "look_id": 1165,
        "keywords": [
            "custom reports",
            "monitoring performance",
            "event data",
            "traffic data",
            "collaboration",
            "configuration"
        ],
        "answer_text": "The Vendor shall provide custom reports for the purposes of monitoring performance of the System, which could include any or all event and traffic data gathered by the Solution. The Vendor shall collaborate with the Owner to determine the configuration, processing, and default content of the custom reports. A maximum of 10 reports will be requested. ITS Central provides a Reports feature that compiles and summarizes data in a presentable manner for the user. A broad range of list and filter settings allow users to customize reports to their needs."
    },
    {
        "look_id": 1166,
        "keywords": [
            "real-time fault reporting",
            "polling devices",
            "notifications",
            "map interface",
            "email notifications",
            "dashboard alerts"
        ],
        "answer_text": "The Solution shall provide real-time fault reporting by polling devices for faults, then providing real-time notifications via the map interface icon through secondary overlays, email notifications for faults, and dashboard flashing alerts."
    },
    {
        "look_id": 1170,
        "keywords": [
            "streaming replication",
            "data loss",
            "backup servers"
        ],
        "answer_text": "Streaming replication will be set up such that data from the live/primary server is always streaming to the secondary (failover) and tertiary (backup) servers – this ensures that there is virtually no risk in losing any data."
    },
    {
        "look_id": 1171,
        "keywords": [
            "software errors",
            "crashes",
            "notifications",
            "designated personnel"
        ],
        "answer_text": "All major software errors and crashes are logged into the system as software issues and notifications are sent to designated personnel for immediate action."
    },
    {
        "look_id": 1169,
        "keywords": [
            "Project Team",
            "authorization",
            "scheduled maintenance",
            "Ministry"
        ],
        "answer_text": "The Project Team will always seek prior authorization from the Ministry before any scheduled maintenance."
    },
    {
        "look_id": 1172,
        "keywords": [
            "monitoring",
            "roadside devices",
            "email alerts",
            "errors",
            "failures"
        ],
        "answer_text": "The personnel may click on the link to be redirected immediately to the issue. The Project Team will be able to monitor the performance of all roadside devices with ease as the team will receive email alerts should any errors/failures be detected by ITS Central."
    },
    {
        "look_id": 1174,
        "keywords": [
            "monitoring",
            "ITS components",
            "MTO",
            "system performance",
            "reporting"
        ],
        "answer_text": "Black & McDonald will be responsible for the monitoring of the operation for all ITS components installed under the contract during the operational and maintenance phase. Where any MTO-supplied material or equipment (existing or otherwise) is found to be damaged or flawed so as to affect system performance, B&M will notify the MTO immediately. The MTO will decide on a course of action with respect to such material or equipment in accordance with the Agreement."
    },
    {
        "look_id": 1175,
        "keywords": [
            "project management",
            "SLA contract administrator",
            "technical support",
            "meeting minutes",
            "MTO"
        ],
        "answer_text": "To ensure appropriate project management practices are established and carried out for the duration of this project. To appoint the SLA contract administrator, technical support personnel and exchange contact information. Approach and Methodology: Upon execution of the Implementation Completion, a project Maintenance meeting will commence between the MTO and the project team. Questions or concerns from either party will be addressed during this meeting and a detailed record of meeting minutes will be kept for future reference."
    },
    {
        "look_id": 1176,
        "keywords": [
            "communication",
            "project management",
            "contingency plan",
            "proactive approach"
        ],
        "answer_text": "Constant communication between the project team and the MTO is essential to ensure any issues arising from production, operation and maintenance are closely monitored and an appropriate contingency plan is provided. Having a proactive approach to project management is necessary to overcoming any challenges."
    },
    {
        "look_id": 1142,
        "keywords": [
            "message priority",
            "VMS",
            "scheduling",
            "ITS Central"
        ],
        "answer_text": "The Solution shall post the message with highest priority rating on the dedicated VMS and retain all other messages with lower priorities in message queue. If two messages assigned to the same VMS have an equal priority rating, the message for the closest event downstream of the VMS shall be posted on the VMS. ITS Central supports five (5) levels of scheduling priorities – Very Low, Low, Medium, High and Very High, where at any given moment, the applicable message, based on the specified time / day recurrence, that has the highest priority will be posted to the VMS."
    },
    {
        "look_id": 1178,
        "keywords": [
            "safety management",
            "environmental management",
            "risk mitigation",
            "project assets"
        ],
        "answer_text": "A comprehensive project safety and environmental management plan will be developed and submitted to the MTO for review. Project safety and environmental protection plan will review site specific safety hazards, risk mitigation strategies, environmental protection policy, include a list of all hospitals and clinics in the vicinity of project assets."
    },
    {
        "look_id": 1143,
        "keywords": [
            "VMS messages",
            "Project Team",
            "Owner",
            "closest issue",
            "queue",
            "sign"
        ],
        "answer_text": "The Project Team will work with the Owner to determine the rules around which VMS messages are displayed and which VMS will display the message. For example, in working with the Owner for the Ministry’s QSVAS, the system determines the 'closest issue' – based on the upstream end of a queue or upstream end of a stopped vehicle location – and posts a message to one sign only unless the VMS is non-functional or if the issue(s) is (are) close to a sign (within a threshold distance), in which case the message will also be posted to the next upstream sign."
    },
    {
        "look_id": 1144,
        "keywords": [
            "view messages",
            "map",
            "last reported status",
            "VMS icon",
            "pop-up window"
        ],
        "answer_text": "The Solution shall provide the ability to view messages displayed on signs through the map, along with an indication of last reported status time. Operators can see the messages posted on signs directly on the map by turning on the sign message layer. In addition, they can click on the VMS icon to see the last reported status time and other details in a pop-up window."
    },
    {
        "look_id": 1181,
        "keywords": [
            "emergency maintenance",
            "response plan",
            "electrical",
            "ITS devices",
            "proactive action"
        ],
        "answer_text": "Emergency response plan for electrical and ITS devices will be based on manufacture recommendations, installation/operations guides. Emergency response plan will be updated as findings are uncovered during maintenance. Device/site condition will be documented, photographed and recommendations for proactive action to prevent future equipment failure will be recorded and communicated to the MTO."
    },
    {
        "look_id": 1146,
        "keywords": [
            "Vendor",
            "collaborate",
            "Owner",
            "VMS icons",
            "UI map"
        ],
        "answer_text": "The Vendor shall collaborate with the Owner to confirm that the icon and its associated conventions are to the satisfaction of the Owner. The base VMS icons for blank and active VMS are provided in #4 of this section. In addition, there are secondary overlay icons that are applied to the base VMS icons to represent a variety of situations directly on the UI map."
    },
    {
        "look_id": 1147,
        "keywords": [
            "notification",
            "equipment issues",
            "Project Team",
            "email",
            "acknowledgment"
        ],
        "answer_text": "The Solution shall provide notification to the Vendor for a sign experiencing failure. When any equipment issues are detected, the appropriate personnel, including members of the Project Team, will automatically be notified of the issues via an email containing a link to the issue in question. The personnel may click on the link to be redirected immediately to the issue, and the system will automatically mark that the user has acknowledged the notification."
    },
    {
        "look_id": 1183,
        "keywords": [
            "emergency call",
            "on-call crew",
            "dispatch",
            "service vehicle",
            "maintenance"
        ],
        "answer_text": "Upon reception of an emergency call at either the 24/7 hour dispatch center or via the list of contacts provided to the MTO, the on-call crew will be briefed on the category of the call and dispatched. On-call field crews will have access to a service vehicle and some material from their home location."
    },
    {
        "look_id": 1187,
        "keywords": [
            "BugTracker",
            "software issues",
            "technical support",
            "QA personnel"
        ],
        "answer_text": "All ITS Central Software issues will be tracked using Transnomis’ own BugTracker system. They will be reviewed by our technical support / QA personnel, with the MTO if required. If the issue is in fact a software defect, the issue will be assigned to a developer to address. An update will be tested and deployed as soon as possible to rectify the issue, while satisfying the SLA requirements for time to repair."
    },
    {
        "look_id": 1185,
        "keywords": [
            "automated maintenance",
            "data archival",
            "data retention",
            "ITS Central"
        ],
        "answer_text": "ITS Central has a built-in maintenance process that, amongst other maintenance tasks, automatically handles the archival and disposal of data records based on the data retention period setup in the system. The following are examples of the routine tasks automated by the maintenance process. All time period specified below are examples only and are configurable."
    },
    {
        "look_id": 1149,
        "keywords": [
            "pictograms",
            "graphics",
            "VMS messages",
            "collaboration",
            "Owner"
        ],
        "answer_text": "The Solution shall support the inclusion of pictograms and graphics in messages, as supported by the VMS. The pictograms and graphics included in the messages shall be in accordance to the situation and location of the event (e.g., indicating correct lane configuration and affected lane(s)). The pictograms to be used are to be determined upon collaboration with the Owner."
    },
    {
        "look_id": 1188,
        "keywords": [
            "system redundancy",
            "fail-over procedure",
            "database replication",
            "server"
        ],
        "answer_text": "An identical software installation will be created in two identical hardware servers as a hot spare and/or for failovers. The database will be set up with streaming replication such that the databases in all three (3) servers will always be in sync. In the event the primary server fails, the secondary server can quickly and automatically take over to become the primary server."
    },
    {
        "look_id": 1151,
        "keywords": [
            "calendar database",
            "ambient light conditions",
            "sunset",
            "sunrise",
            "time-based information"
        ],
        "answer_text": "The Solution shall be capable of storing and retrieving data from a calendar database to determine ambient light conditions (approximate sunset & sunrise timings) throughout the GCSS System specific to each day of the year. The Solution shall be capable of retrieving information on weekdays/weekend days, holidays, seasons and other time/date-based information from the calendar database."
    },
    {
        "look_id": 1153,
        "keywords": [
            "web-based",
            "no installation",
            "operator workstations"
        ],
        "answer_text": "ITS Central is web-based and does not require installation of any additional software at operator workstations."
    },
    {
        "look_id": 1155,
        "keywords": [
            "simultaneous operations",
            "dozens of users",
            "Municipal511",
            "Ontario"
        ],
        "answer_text": "ITS Central allows simultaneous operations by dozens of users in the application without apparent lag or impact. Its derivative product, Municipal511, is used simultaneously by over 200 municipalities across Ontario."
    },
    {
        "look_id": 1157,
        "keywords": [
            "manage account",
            "user information",
            "preferences",
            "passwords"
        ],
        "answer_text": "ITS Central provides users with the ability to manage their own account, including changing user information, preferences, and passwords."
    },
    {
        "look_id": 1160,
        "keywords": [
            "map view",
            "user interface",
            "ergonomics",
            "CRCTMC Operations Room"
        ],
        "answer_text": "The Solution shall provide a map view user interface that is configurable to be ergonomically suitable for display on two side-by-side screens of the CRCTMC Operations Room video wall, graphically tailored and sized to meet human factors and ergonomics needs for legibility and comprehension of operations staff working at their consoles in the Control Room."
    },
    {
        "look_id": 1162,
        "keywords": [
            "RESTful API",
            "real-time",
            "traffic events",
            "weather events"
        ],
        "answer_text": "The Solution shall make available through a RESTful API the near real-time traffic and weather events in either XML or JSON, which include: Newly detected events, Updates to existing events, Clearance of existing events."
    },
    {
        "look_id": 1164,
        "keywords": [
            "email alerts",
            "CRCTMC",
            "active events",
            "updates"
        ],
        "answer_text": "The Solution shall provide email alerts to Operators at CRCTMC for all active events, updates, and clearance of events. The administrator is able to specify the appropriate personnel to be notified for all active events, updates, and clearance of events."
    },
    {
        "look_id": 1167,
        "keywords": [
            "hardware",
            "software",
            "hosting",
            "temperature rating",
            "processing power",
            "memory",
            "storage"
        ],
        "answer_text": "The Project Team will provide all hardware and software needed to host ITS Central. The hardware will be properly rated for extended temperature, processing power, memory and storage to host ITS Central to perform the GCSS functions. The hardware will be installed in the field to minimize communication delays and risks."
    },
    {
        "look_id": 1168,
        "keywords": [
            "user accounts",
            "user groups",
            "permission privileges",
            "operational needs"
        ],
        "answer_text": "ITS Central allows System Administrators to assign user accounts to any one of the listed user groups. It also allows system administrators to create new user groups with a hybrid of permission privileges to cater to new operational needs."
    },
    {
        "look_id": 1173,
        "keywords": [
            "System Operational Support",
            "Warranty",
            "Maintenance",
            "Service Level Agreement",
            "GCSSS"
        ],
        "answer_text": "Black & McDonald (B&M) will be responsible for System Operational Support, Warranty and Maintenance for the GCSSS. B&M will provide the System Management, Routine Maintenance, System Enhancement and Emergency Support Activities to support the GCSSS field equipment, associated civil infrastructure supplied, installed, replaced or modified in this Contract. All activities will follow the requirements specified in the Service Level Agreement to ensure equipment and system performance levels are met throughout the life of the Contract."
    },
    {
        "look_id": 1177,
        "keywords": [
            "routine maintenance",
            "Scheduled System Maintenance Plan",
            "inspection services",
            "compliance"
        ],
        "answer_text": "Routine maintenance services will be scheduled in accordance to the approved Scheduled System Maintenance Plan. It will be conducted for all GCSS components and existing COMPASS system equipment within the contract limits. Routine maintenance and inspection services will comply with the Equipment Specific Scheduled Maintenance Requirements outline in the SLA, manufacture recommendations and be in accordance with the ITS elements and operation and maintenance manuals."
    },
    {
        "look_id": 1179,
        "keywords": [
            "software updates",
            "performance enhancement",
            "system bugs",
            "user feedback"
        ],
        "answer_text": "Software updates will be rolled out to the GCSS to enhance performance, resolve system bugs and to address requests for system changes. Software bugs will be identified by system operators (self-identification), automated system performance reports and user feedback."
    },
    {
        "look_id": 1180,
        "keywords": [
            "warranty",
            "Black & McDonald Limited",
            "equipment",
            "materials",
            "repair",
            "replacement"
        ],
        "answer_text": "Black & McDonald Limited will provide warranty on all labour, equipment and materials provided. All equipment and materials provided will be free of material defect and will perform to the required standard for a period of five (4) years, commencing upon completion of construction phase. The warranty applies to all materials provided and work completed during this contract. For the duration of this warranty period, Black & McDonald Limited will repair or replace any equipment that fails, at no additional cost to the MTO."
    },
    {
        "look_id": 1182,
        "keywords": [
            "emergency dispatch center",
            "24/7",
            "on-call manpower",
            "project schedule"
        ],
        "answer_text": "A 24/7 emergency dispatch center will be established and staffed for the duration of the contract. Dispatch contact information will be provided to the MTO. Primary and back up on-call manpower will be assigned to the project schedule. On-call crew availability will be reviewed during bi-weekly manpower meetings."
    },
    {
        "look_id": 1184,
        "keywords": [
            "information management",
            "maintenance activities",
            "log book",
            "record keeping"
        ],
        "answer_text": "To ensure reports of all electrical and ITS emergency maintenance activities are recorded in detail and available. The non-routine maintenance log book will be updated every time an attendance to an electrical or ITS asset is made for all call out activities. Crews will record the time the repair was completed and when the component became fully operational. All time of day references will be in the 24-hour clock format. Entries in logbooks will be signed and dated and kept for the duration of the project term."
    },
    {
        "look_id": 1186,
        "keywords": [
            "manual monitoring",
            "system performance",
            "routine review",
            "algorithm"
        ],
        "answer_text": "In addition to automated processes for monitoring and maintenance, Transnomis will have staff perform routine review of the system operation to ensure system performance: Review of weather, road condition, queue and stopped vehicle issues, as well as combination issues, detected to ensure the algorithm is working as expected."
    },
    {
        "look_id": 1192,
        "keywords": [
            "turn-key traffic data collection system",
            "CCTV monitoring solution",
            "frost depth monitoring system",
            "GNWT",
            "previous projects"
        ],
        "answer_text": "We successfully delivered a turn-key traffic data collection system in 2021 and are in the process of completing the addition of a CCTV monitoring solution, and a frost depth monitoring system as well."
    },
    {
        "look_id": 1191,
        "keywords": [
            "completed projects",
            "municipalities",
            "provinces",
            "territories",
            "Canada",
            "GNWT",
            "collaboration",
            "project history"
        ],
        "answer_text": "We have successfully completed over 60 projects for municipalities, provinces, and territories across Canada. Stinson ITS has worked with GNWT over the past 3 years on a number of projects such as this."
    },
    {
        "look_id": 1194,
        "keywords": [
            "Transnomis",
            "technology company",
            "integration projects",
            "MTO",
            "City of Toronto",
            "City of Edmonton",
            "collaboration",
            "Metrolinx"
        ],
        "answer_text": "Transnomis is a Canadian technology company that has completed many large-scale integration projects for the Ministry of Transportation Ontario (MTO), City of Toronto, City of Edmonton, Region of Durham, and Region of Waterloo. Stinson ITS and Transnomis have worked collaboratively to provide hosted travel time display services to Metrolinx for the Eglinton Cross Town LRT and Finch LRT construction projects in collaboration with Stinson ITS."
    },
    {
        "look_id": 1196,
        "keywords": [
            "ITS Central",
            "flagship software",
            "transportation agencies",
            "market experience",
            "Municipal511"
        ],
        "answer_text": "ITS Central is Transnomis’s flagship software package that has been on the market for over a decade. It has been implemented by many major transportation agencies including: Ontario Ministry of Transportation (MTO), City of Toronto, City of Edmonton, City of Loveland, Region of Waterloo, Region of Durham, Region of York, BC Ferries, and over 200 Ontario Municipalities, through the cloud-hosted Municipal511 service."
    },
    {
        "look_id": 1197,
        "keywords": [
            "GNWT staff",
            "create",
            "update",
            "data",
            "system",
            "ITSC",
            "Transportation Information Portal"
        ],
        "answer_text": "GNWT staff can create and update data within the system, with all changes feeding into ITSC and the Transportation Information Portal."
    },
    {
        "look_id": 1199,
        "keywords": [
            "servers",
            "quality assurance testing",
            "training",
            "user acceptance",
            "production"
        ],
        "answer_text": "The system will use a total of 6 servers for the purposes of quality assurance testing, training, user acceptance, and production."
    },
    {
        "look_id": 1201,
        "keywords": [
            "bug reports",
            "user requests",
            "improvements",
            "suggestions",
            "BugTracker system"
        ],
        "answer_text": "Transnomis continuously ingests bug reports and user requests for improvements and suggestions from clients. These are cataloged within Transnomis’ proprietary BugTracker system for prioritization and tracking."
    },
    {
        "look_id": 1198,
        "keywords": [
            "Transportation Information Portal",
            "ITSC",
            "public",
            "traveller information",
            "road conditions",
            "transportation events",
            "GNWT"
        ],
        "answer_text": "Transportation Information Portal: A separate ITSC deployment with a lightweight feature set, intended for use by the public and providing basic traveller information about road conditions, transportation events/incidents, and any other information GNWT may wish to make publicly available."
    },
    {
        "look_id": 1200,
        "keywords": [
            "roadmap",
            "new features",
            "developments",
            "future-ready",
            "technologies",
            "use cases"
        ],
        "answer_text": "Transnomis has a roadmap for new features and developments, many of which are already in the development and pilot stages. We are committed to ensuring the product is future-ready for new technologies and use cases."
    },
    {
        "look_id": 1202,
        "keywords": [
            "configurable",
            "user preferences",
            "system requirements",
            "adjusted"
        ],
        "answer_text": "Many aspects of ITSC are configurable to user preferences and system requirements. Below are a number of examples of system elements that can be adjusted by users."
    },
    {
        "look_id": 1204,
        "keywords": [
            "map-based interface",
            "ITS Central",
            "layers",
            "data",
            "user preferences"
        ],
        "answer_text": "ITS Central (ITSC) uses a map-based interface that is supported across all modern browsers. Information is displayed to the user as a series of layers: a base map layer, and then additional layers containing different data and features, all of which can be shown/hidden depending on the user’s preferences and account permissions."
    },
    {
        "look_id": 1203,
        "keywords": [
            "ITS Central",
            "features",
            "transportation management",
            "monitoring",
            "analysis"
        ],
        "answer_text": "ITS Central includes a wide array of features, developed specifically for advanced transportation management, where central control is required to access, monitor, and analyse devices and information from a geographic region. It was developed with feedback from hundreds of transportation professionals and road authorities."
    },
    {
        "look_id": 1205,
        "keywords": [
            "performance",
            "optimization",
            "Transnomis",
            "user experience",
            "tuning techniques"
        ],
        "answer_text": "All Transnomis products and modules are designed from the ground up with performance in mind. Transnomis utilizes all applicable performance tuning techniques, such as database query tuning, code review for performance optimization, database table index, in-memory caching, minification, and image sprites. All of the above contributes to the highly responsive user experience for ITS Central."
    },
    {
        "look_id": 1207,
        "keywords": [
            "joint solution",
            "GNWT",
            "Department of Infrastructure",
            "transportation system information",
            "highway conditions data"
        ],
        "answer_text": "The joint solution proposed by Stinson ITS, Transnomis and Global Storm IT will help the GNWT’s Department of Infrastructure (INF) to utilize an optimal, secure system to gather, manage and share NWT highway conditions data and transportation system information across various channels to different audiences."
    },
    {
        "look_id": 1209,
        "keywords": [
            "implementation team",
            "intelligent transportation system",
            "project administration",
            "project management",
            "software development"
        ],
        "answer_text": "The project implementation team members have successfully delivered multiple large intelligent transportation system projects in the past 5 years and have the right mix of experience in project administration, project management and coordination, customer liaising, software development, Dev Sec Ops and testing."
    },
    {
        "look_id": 1206,
        "keywords": [
            "user accounts",
            "access control",
            "read-only",
            "read-write",
            "mobile support"
        ],
        "answer_text": "User accounts and user groups may be restricted to read-only access or read-write access. Restrictions may be based on different data layers for different user groups. ITS Central supports all major tablet and smartphone device types with no difference in functionality between desktop and mobile users."
    },
    {
        "look_id": 1208,
        "keywords": [
            "project team",
            "Stinson ITS",
            "Transnomis",
            "Global Storm IT",
            "data integrations",
            "system security"
        ],
        "answer_text": "The joint project team from Stinson ITS, Transnomis and Global Storm IT has the right mix of individuals from experienced project managers, software architects, developers, and testers to ensure that the Transportation Information Reporting System project is completed with all the right data integrations, collection, storage, reporting, management, dissemination, and user interfaces with the right system security."
    },
    {
        "look_id": 1214,
        "keywords": [
            "project management",
            "customer relations",
            "GNWT projects",
            "ITS solutions",
            "task scheduling",
            "site supervision"
        ],
        "answer_text": "Matt’s proven expertise in building and managing relations with customers, contractors, drivers, and vendors helps schedule, align and complete project tasks on time. He has led the GNWT projects for Stinson ITS including performing end-to-end project management of engineered ITS solutions from shipping and receiving of materials to project task scheduling, resource, quality and cost management, contract management, site supervision and maintenance for traffic sensors, traffic cameras, and thermistor projects."
    },
    {
        "look_id": 1216,
        "keywords": [
            "application design",
            "secure applications",
            "system scalability",
            "Microsoft Azure",
            "high-availability"
        ],
        "answer_text": "Roy knows how to design and build reliable and secure applications based on client requirements. He is also passionate about learning and applying new technologies to improve system scalability and efficiency. While at Stericycle, Roy was involved in moving the system to the Microsoft Azure cloud platform, with the goal of improving the system’s high-availability and scalability."
    },
    {
        "look_id": 1218,
        "keywords": [
            "functional testing",
            "system testing",
            "regression testing",
            "test cases",
            "QA theory"
        ],
        "answer_text": "Zaynab has extensive experience in functional testing: system testing, regression testing, integration testing, stress testing, security testing, UA testing, GUI testing. She is proficient in execution, authoring, and reviewing test cases based on design, functional requirements specifications and product requirement documents."
    },
    {
        "look_id": 1220,
        "keywords": [
            "requirement discovery",
            "technical documentation",
            "approval process",
            "software development",
            "user acceptance testing",
            "issue resolution"
        ],
        "answer_text": "Our requirement discovery, analysis and approval process allow us to ensure the deployments proceed without a hitch. We will provide a detailed technical documentation for each external integration needed by the Government of Northwest Territories. The documented technical requirements will be reviewed jointly and submitted for approval to the GNWT team. Only after approval all software development, configuration changes, testing and deployment on user acceptance testing instance will be completed. On successful testing of the functionality by the users the features or changes will be deployed to the production instance. If any issues are observed during the user acceptance testing the issues will be recorded and resolved in the next sprint of changes. If the observed issues are deemed major by the GNWT team, then the feature/changes on the user acceptance testing instance will only be pushed to production instance after the issue is resolved."
    },
    {
        "look_id": 1217,
        "keywords": [
            "QA team",
            "test plans",
            "test cases",
            "manual testing",
            "cross-browser compatibility"
        ],
        "answer_text": "Anamika works with our QA team and shares an expertise in developing and documenting manual/automated test plans, test cases, and QA/QC processes. She also completes manual exploratory, usability, and ad-hoc testing in our applications to ensure quality and cross-browser compatibility."
    },
    {
        "look_id": 1219,
        "keywords": [
            "project management",
            "Ajay Kaushik",
            "Yeatland Wong",
            "customer touchpoints",
            "project meetings",
            "accountability"
        ],
        "answer_text": "Successful projects start with strong project management. This project will be led by Ajay Kaushik, PMP and Yeatland Wong, P.Eng., Project Managers from Stinson ITS and Transnomis Solutions. Ajay and Yeatland are backed by highly experienced industry veterans Michael McGuire and Simon Foo, Ph.D., P.Eng.. The Territory can expect regular customer touchpoints, productive project meetings, extensive documentation, and full accountability as mentioned in the project team section above."
    },
    {
        "look_id": 1221,
        "keywords": [
            "timely customer service",
            "bug fixes",
            "technical support",
            "feature development",
            "SLA",
            "BugTracker Software"
        ],
        "answer_text": "Throughout the project, Stinson ITS will ensure that the project team provides timely customer service to GNWT, providing responses in an expedient manner where possible, and updates and progress for responses that take more time. Stinson ITS will be responsible for intake and assigning of all customer service requests. Throughout the operational period, requests for bug fixes, technical support, and feature development will be handled via the SLA. Tracking of software change requests will be done through Transnomis’ proprietary internal BugTracker Software."
    },
    {
        "look_id": 1223,
        "keywords": [
            "project scope",
            "supply",
            "installation",
            "implementation",
            "support",
            "maintenance",
            "data collection",
            "reporting platform"
        ],
        "answer_text": "The project scope includes supply, installation, implementation, support, and maintenance of Transportation Information Reporting System as per the requirements, terms, and conditions written in the RFP. The system acts as a central hub for data collection, storage, and reporting platform for the following list of systems (and possibly more in future), providing an intuitive user interface to different types of users."
    },
    {
        "look_id": 1224,
        "keywords": [
            "TIRS system",
            "automation",
            "data collection",
            "reporting",
            "real-time",
            "data management",
            "expandable"
        ],
        "answer_text": "The TIRS system will automate the collection, storage, and reporting of transportation system information in near real-time across various channels, including emails, SMS, telephone, social media, and the mobile-responsive online portal. The TIRS system shall also be able to facilitate management and dissemination of transportation data without much manual intervention by staff members and be expandable to include more data and information sources, systems, communication channels, and users in future."
    },
    {
        "look_id": 1226,
        "keywords": [
            "third-party assessment",
            "IT threats",
            "risk assessment",
            "GNWT",
            "security improvements"
        ],
        "answer_text": "At this stage of the project, all new features are expected to be complete and ready for a third-party vulnerability assessment. The assessment will be key to identifying IT threats facing the data, user information, access to other systems, and networks, as well as assessing the possible consequences should any adverse events take place. As required by the GNWT in the RFP, a document for annual risk assessment will also be created with the third party. Software or system security improvements will be made to address any issues identified in the third-party risk assessment after consultation with the GNWT project team."
    },
    {
        "look_id": 1228,
        "keywords": [
            "training",
            "multi-class",
            "in-person",
            "virtual",
            "user preferences",
            "map interface",
            "data layers"
        ],
        "answer_text": "A comprehensive multi-class training shall be provided to all users. This training shall be scheduled after discussions with the GNWT Project Manager and will be either in-person or virtual according to the client’s preferences. All training (virtual or in-person) shall be recorded for team members for reference and for other team members who may not be able to attend. The training will cover: Logging in and adjusting user preferences, Navigating the map interface, Using data layers, Finding entities in the system (from the map, from search, from lists), Reviewing entity details (fields and other data), Using the entity detail tabs, including comments and file uploads, Generating reports (graph and table options), Adding new entities to the system, Controlling and sending notifications, Admin-level settings and controls."
    },
    {
        "look_id": 1230,
        "keywords": [
            "failover",
            "virtual machines",
            "system monitoring",
            "GNWT IT"
        ],
        "answer_text": "To mitigate the risk of single instance of the installation, we will coordinate with GNWT IT staff on their failover and system monitoring procedures and install failover virtual machines on multiple servers to provide highest up time."
    },
    {
        "look_id": 1189,
        "keywords": [
            "Transportation Information Reporting System",
            "TIRS",
            "implementation",
            "integration",
            "installation",
            "configuration",
            "operation",
            "training",
            "maintenance",
            "troubleshooting",
            "collaboration"
        ],
        "answer_text": "Stinson ITS Inc, in collaboration with Transnomis Solutions Inc. and Global Storm IT, is pleased to provide the Government of Northwest Territories (GNWT) with the enclosed proposal for the implementation, integration, installation, configuration, operation, training, maintenance, and troubleshooting of a Transportation Information Reporting System (TIRS) Solution."
    },
    {
        "look_id": 1190,
        "keywords": [
            "supplier",
            "integrated transportation solutions",
            "experience",
            "expertise",
            "project support",
            "design consultation",
            "implementation",
            "operation",
            "maintenance"
        ],
        "answer_text": "Stinson ITS has been a leading supplier of complex, integrated transportation solutions for over 8 years. Our diverse and talented team has the expertise to support every aspect of a project, from early design consultation to implementation to long term operation and maintenance."
    },
    {
        "look_id": 1193,
        "keywords": [
            "completed projects",
            "GNWT",
            "traffic data collection",
            "CCTV monitoring",
            "frost depth monitoring",
            "API integrations",
            "centralized data"
        ],
        "answer_text": "We have successfully completed over 60 projects for municipalities, provinces, and territories across Canada. Stinson ITS has worked with GNWT over the past 3 years on a number of projects such as this. We successfully delivered a turn-key traffic data collection system in 2021 and are in the process of completing the addition of a CCTV monitoring solution, and a frost depth monitoring system as well. All three of these projects span the entire territory and like the TIRS system, involve device and API integrations to centralize data in a single portal to allow for simplified monitoring and operations."
    },
    {
        "look_id": 1195,
        "keywords": [
            "project team",
            "methodical manner",
            "TIRS",
            "system integrations",
            "data collection",
            "security compliance"
        ],
        "answer_text": "Our project team is committed to working in a methodical manner with the GNWT to deliver the Transportation Information Reporting System (TIRS), while satisfying all requirements for system integrations, data collection, storage, and reporting, with the right level of security to meet GNWT’s IT data security and privacy policies."
    },
    {
        "look_id": 1225,
        "keywords": [
            "iteration 4",
            "test scenarios",
            "QA testing",
            "demo",
            "GNWT project team"
        ],
        "answer_text": "Test scenarios and plans for iteration 4 will be submitted for approval to the GNWT project team at the start of iteration 4. At the completion of software development iteration 4, QA testing will be performed, producing a test results document. The QA test results will be submitted to GNWT project team. A demo of the portal shall be given to the GNWT project team at the end of the iteration 4."
    },
    {
        "look_id": 1227,
        "keywords": [
            "User Acceptance Testing",
            "UAT",
            "go-live",
            "real-world situations",
            "validation"
        ],
        "answer_text": "User Acceptance Testing (UAT), or application testing, is the final stage of any software development or change request lifecycle before go-live. UAT meaning the final stage of any development process to determine that the software does what it was designed to do in real-world situations. Actual users from the GNWT shall test the software to determine if it does what it was designed to do in real-world situations, validating software features, and integrations as per the requirements documentation. The main purpose of acceptance testing is to validate end-to-end requirements. All issues observed (if any) shall be documented, discussed and approved for resolution before final system acceptance and Go Live."
    },
    {
        "look_id": 1229,
        "keywords": [
            "user documentation",
            "instructions",
            "UI guidance",
            "TIRS system",
            "hard copies",
            "digital copies"
        ],
        "answer_text": "Final user documentation shall be submitted with the full system training. The user documentation provides instructions, UI guidance, and visual content for easily understanding use of different functionality provided by the TIRS system. Two hard copies, digital copies, and online documentation will be available for use by users of GNWT."
    },
    {
        "look_id": 1231,
        "keywords": [
            "delays",
            "approvals",
            "project managers",
            "GNWT",
            "risk mitigation"
        ],
        "answer_text": "Delays in approvals can have a major impact on the schedule of the project. Our project managers will work closely with GNWT project managers to ensure they are available to answer any questions to facilitate early approvals of documents, requirements, test plans, system installation plan etc. A detailed list of risk and mitigation strategies can be drafted with GNWT during the discovery phase of this contract."
    },
    {
        "look_id": 1232,
        "keywords": [
            "Confluence",
            "knowledge base",
            "business continuity",
            "knowledge transfer"
        ],
        "answer_text": "Transnomis makes heavy use of Confluence, an internal knowledge base application, to document all key procedures, business plans, and important information. In the event of sudden employee departure (due to resignation or injury), or of damage to the offices, all important information remains backed up with the intent of ensuring a smooth transfer of knowledge to any new staff."
    },
    {
        "look_id": 1234,
        "keywords": [
            "code review",
            "critical system functions",
            "senior developer",
            "software manager"
        ],
        "answer_text": "Critical system functions (such as security functions, control logic functions, and interlock safety functions) are all reviewed twice – once by a senior developer and once by the software manager. This is to ensure correct, logical, and error-free implementation."
    },
    {
        "look_id": 1236,
        "keywords": [
            "test procedures",
            "technical requirements",
            "test coverage",
            "matrix"
        ],
        "answer_text": "The project team will develop a series of test procedures that cover all of the technical requirements. A matrix will clearly show that each technical requirement is covered, and under which tests."
    },
    {
        "look_id": 1238,
        "keywords": [
            "User Acceptance Testing",
            "UAT",
            "documentation",
            "expectations",
            "GNWT",
            "technical requirements"
        ],
        "answer_text": "The Acceptance test process hinges on clear documentation of the expectations, approval of those expectations, and documentation of the formal results. Our User Acceptance Test plan will be reviewed and agreed upon in advance. GNWT will be invited to witness the UAT; these tests will cover all of the technical requirements of this project, using scenarios designed to illustrate the functionality of all technical requirements have been achieved."
    },
    {
        "look_id": 1233,
        "keywords": [
            "review process",
            "project deliverables",
            "GNWT",
            "quality control"
        ],
        "answer_text": "Project deliverables will be reviewed prior to delivery to the GNWT. The review process is performed in three (3) stages: Conformance to Transnomis standards (e.g., Transnomis Core QC Plan), Conformance to clients’ applicable document standards, Conformance to project requirements."
    },
    {
        "look_id": 1235,
        "keywords": [
            "Continuous Integration",
            "CI",
            "GitLab",
            "automated testing"
        ],
        "answer_text": "At Transnomis Solutions, the technical team practices Continuous Integration (CI). Developers merge their code into a shared repository (GitLab) several times a day and the code in each merge is tested using automated testing."
    },
    {
        "look_id": 1237,
        "keywords": [
            "test reports",
            "documentation",
            "expected results",
            "actual results"
        ],
        "answer_text": "Test reports will be provided for each of the tests. Test reports will document what the test consisted of, when the tests took place, what the expected results were, and what the actual results were."
    },
    {
        "look_id": 1239,
        "keywords": [
            "user manual",
            "documentation",
            "features",
            "modules",
            "Transnomis",
            "development practices"
        ],
        "answer_text": "A customized user manual will be provided to the client after all new features have been implemented. The manual will cover every major feature and option in the system with the intent of providing an authoritative guide to all modules and integrations. The manual will be kept up to date as new features are developed and released — updates to documentation are a crucial component of Transnomis’s development practices, and a documentation specialist reviews all changes before they are deployed to ensure the manual is complete and correct."
    },
    {
        "look_id": 1240,
        "keywords": [
            "Transnomis",
            "Ontario",
            "technology company",
            "road information management",
            "Intelligent Transportation System",
            "ITS Central"
        ],
        "answer_text": "Transnomis is an Ontario-based technology company that specializes in road information management and communications solutions, for agencies with road information, and all that need it. More than 200 municipalities and road authorities use one or more of Transnomis’s software systems. Since 2007, Transnomis has been building a comprehensive Intelligent Transportation System (ITS) called ITS Central to provide specialized ATMS Control for ITS."
    },
    {
        "look_id": 1242,
        "keywords": [
            "full training",
            "GNWT",
            "in-person training",
            "online training",
            "train the trainer"
        ],
        "answer_text": "A full training for all relevant users will be provided on the completion of the project (Task 13 in the project plan). The following options are available for training: i. In-Person Training: A 2-day in-person training will be given at the GNWT office for users. Printed and soft copies of the training material will be provided. The training will be focused on the use-cases documented during the requirements phase of the project. ii. Online Training: A 2–4-hour follow-up online training will be provided to the users. A recording of online training shall be available for reference to the users. iii. Train the Trainer Program – Subject matter experts / trainers from different departments shall be trained on specific topics for additional 2–4-hour online training. Any training documentation requested by the trainers shall be provided to them."
    },
    {
        "look_id": 1244,
        "keywords": [
            "training",
            "user manual",
            "Quick Reference Instructions",
            "GNWT",
            "in-person training",
            "virtual training"
        ],
        "answer_text": "One on-site in-person training session is included for this project, as well as two additional virtual training sessions if desired. Recording of the virtual training sessions is available if requested in advance. A user manual will be provided digitally. The user manual is intended as a comprehensive reference for operators. As additional features are developed and released, the user guide will be updated. In addition to the user manual, a small number of Quick Reference Instructions will be created upon request. These Quick Reference guides are simple step-by-step instructions, to cover specific common tasks that GNWT encounters, such as 'How do I create a report of malfunctioning devices?' or 'How do I disable all VMS'? Typically, 5-10 Quick Reference Instructions are created for the most common or complicated tasks."
    },
    {
        "look_id": 1246,
        "keywords": [
            "maintenance",
            "operating system patches",
            "security patches",
            "system issues",
            "ITSC logs"
        ],
        "answer_text": "Transnomis will perform all routine and urgent maintenance activities such as monthly operating system patches, urgent OS security patches, inactive user review and removal, review of system issues and crashes, and review of ITSC logs and Windows Logs for issues."
    },
    {
        "look_id": 1241,
        "keywords": [
            "training",
            "implementation",
            "GNWT",
            "ITS Central",
            "user capabilities"
        ],
        "answer_text": "This is a large and long-term project from GNWT team. The training options we offer for the GNWT team can be categorized as: 1. Training During Implementation: A new transportation information reporting system with many system integrations and data layers can take time for the users to get comfortable with all features and capabilities. We firmly believe that the off-the-shelf capabilities of the ITS central software are easy to use for users and, therefore, intend to provide short demos and trainings to GNWT project team as the software is being developed. This approach has 2 advantages: 1. It helps GNWT team members to get access to start using the off-the-shelf capabilities as soon the first phase of software implementation is complete (approximately 6 months before the final project completion). This gives more time for GNWT team members to familiarize themselves with the system and to raise questions or issues. 2. The development team gets feedback from GNWT project team for improvements in next iterations of software development."
    },
    {
        "look_id": 1243,
        "keywords": [
            "customized training",
            "GNWT",
            "use cases",
            "virtual training",
            "user manual"
        ],
        "answer_text": "The training will be customised to the GNWT, covering only the modules used by GNWT. Use cases and hands-on examples will be provided during the training. GNWT may also request specific scenarios and use cases to be covered in the training. Training slides will be custom developed for GNWT and provided to GNWT. One on-site in-person training session is included for this project, as well as two additional virtual training sessions if desired. Recording of the virtual training sessions is available if requested in advance. A user manual will be provided digitally."
    },
    {
        "look_id": 1245,
        "keywords": [
            "CyberSecure Canada",
            "ISO27001",
            "security policies",
            "certification",
            "Transnomis"
        ],
        "answer_text": "Transnomis is currently pursuing certification from CyberSecure Canada, which we expect to be complete by Q1 of 2024. Transnomis has already implemented a number of required security policies and procedures, including onboarding procedures, offboarding procedures, patch management, application policy, key rotation, single-sign-on, Central Identity Management and two-factor authentication, and a digital asset catalog. Transnomis plans to complete ISO27001 certification by Q4 of 2024."
    },
    {
        "look_id": 1247,
        "keywords": [
            "audit",
            "certified external audit",
            "data security",
            "system integrity"
        ],
        "answer_text": "Transnomis has committed to provide details of a certified external audit of our systems, their integrity, and all data security practices. Copies of required certification documents will be provided if available."
    },
    {
        "look_id": 1248,
        "keywords": [
            "redundant system",
            "failover",
            "database replication",
            "streaming replication",
            "primary server"
        ],
        "answer_text": "An identical software installation will be created in two identical hardware servers as a hot spare and/or failover. The database will be set up with streaming replication such that the databases in both servers will always be in sync. In the event the primary server fails, the secondary server can quickly and automatically take over to become the primary server."
    },
    {
        "look_id": 1249,
        "keywords": [
            "Black & McDonald",
            "commitment",
            "innovative solutions",
            "cost-effective",
            "safety",
            "integrity"
        ],
        "answer_text": "Black & McDonald Limited (B&M) is committed to implementing innovative and cost-effective solutions to its customers’ requirements on time, on budget, and with safety foremost in mind. Black & McDonald is a reliable and flexible contractor operating with integrity and loyalty to employees, customers, suppliers, and the communities we serve."
    },
    {
        "look_id": 1251,
        "keywords": [
            "B&M",
            "experience",
            "electrical contractor",
            "utility sector",
            "maintenance contracts"
        ],
        "answer_text": "B&M offers the benefit of more than ninety years’ experience as an electrical contractor and over forty years’ experience in the Utility Sector and Maintenance contracts."
    },
    {
        "look_id": 1253,
        "keywords": [
            "health",
            "safety",
            "environment",
            "work environment"
        ],
        "answer_text": "B&M is committed to protecting their people, their property and the environment and will take all necessary steps to provide and maintain a safe and healthy work environment."
    },
    {
        "look_id": 1250,
        "keywords": [
            "labour force",
            "skills",
            "best practices",
            "training",
            "expertise",
            "health and safety"
        ],
        "answer_text": "B&M will provide a labour force whose selection is based on the required skills and level of expertise. This ensures that best practices and leading edge methodologies are implemented for every contract with which we work. Our staff members continuously train and update their skills, providing our clients with expertise and knowledge in all areas of operation, maintenance, health and safety."
    },
    {
        "look_id": 1252,
        "keywords": [
            "equipment",
            "systems",
            "maximum efficiency",
            "operating costs"
        ],
        "answer_text": "B&M ensures that equipment and systems operate at maximum efficiency."
    },
    {
        "look_id": 1254,
        "keywords": [
            "Project Team",
            "B&M",
            "Transnomis",
            "LEA",
            "Stinson ITS",
            "project management",
            "construction",
            "maintenance"
        ],
        "answer_text": "The Project Team (the “Team”) is composed of a strong suite of companies namely B&M, Transnomis, LEA, and Stinson ITS. B&M is an experienced ITS contractor. B&M, serving as the prime proponent, providing project management, construction, routine maintenance and emergency services for the Project."
    },
    {
        "look_id": 1256,
        "keywords": [
            "Stinson ITS",
            "Manufacturer",
            "Distributor",
            "System Integrator",
            "Intelligent Transportation Systems",
            "Turn-Key Solutions"
        ],
        "answer_text": "Stinson ITS is a Manufacturer, Distributor and System Integrator of Intelligent Transportation Systems (ITS) with a focus on providing Turn-Key Solutions. With a diverse and talented team, we have the expertise to assist with every aspect of a project, from early design consultations to implementation to long term operation and maintenance."
    },
    {
        "look_id": 1255,
        "keywords": [
            "LEA Consulting",
            "planning",
            "engineering design",
            "construction administration",
            "urban infrastructure"
        ],
        "answer_text": "LEA is a privately-held, Canadian consulting firm providing planning, engineering design, and construction administration services for urban infrastructure projects. LEA’s clients and partners include public sector agencies at all three levels of governments across Canada, major developers, architects, contractors, and law firms."
    },
    {
        "look_id": 1258,
        "keywords": [
            "Transnomis",
            "Ontario",
            "technology company",
            "road information management",
            "communications solutions",
            "MTO",
            "approved vendor",
            "ATMS",
            "Firmware",
            "ITS Central"
        ],
        "answer_text": "Transnomis is an Ontario based technology company that specializes in road information management and communications solutions, for agencies with road information, and all that need it. MTO has certified Transnomis as an approved vendor for providing ATMS and Firmware for field hardware in its Registry, Appraisal and Qualification System (RAQS). Since 2007, Transnomis has been building a comprehensive Intelligent Transportation System (ITS) called ITS Central to provide specialized ATMS Control for ITS."
    },
    {
        "look_id": 1260,
        "keywords": [
            "Transnomis",
            "experience",
            "software control systems",
            "road information management",
            "ITS device",
            "traffic data sensors",
            "traffic signal systems",
            "video analytics",
            "GIS",
            "AVL",
            "RWIS"
        ],
        "answer_text": "Transnomis has 14 years of experience building user friendly and custom software control systems for road information management and ITS device. Transnomis has integrated traffic data sensors, traffic signal systems, video analytics systems, work management systems, video management systems, geographic information systems (GIS), automatic vehicle locators (AVL), and road weather information systems (RWIS)."
    },
    {
        "look_id": 1262,
        "keywords": [
            "change management",
            "JDE",
            "Change Orders",
            "budget impact",
            "project tracking"
        ],
        "answer_text": "B&M uses JDE to track and manage the change management process for all projects. Change Requests contain important information regarding a potential customer Change Order including; brief description, reference numbers, associated dates and all required adjustments to estimated man-hours, cost and revenue which impact the overall budget of a job. Change Orders should always be entered into JD Edwards at a “submitted” status before the quote letter is submitted to the customer. This ensures that quoted Change Order amounts are visible on the Job Status Inquiry and on certain Job Reports."
    },
    {
        "look_id": 1257,
        "keywords": [
            "Stinson ITS",
            "Manufacturer",
            "Distributor",
            "System Integrator",
            "Intelligent Transportation Systems",
            "Turn-Key Solutions",
            "design consultations",
            "implementation",
            "operation",
            "maintenance",
            "service levels",
            "maintenance warranties"
        ],
        "answer_text": "Stinson ITS is a Manufacturer, Distributor and System Integrator of Intelligent Transportation Systems (ITS) with a focus on providing Turn-Key Solutions. With a diverse and talented team, we have the expertise to assist with every aspect of a project, from early design consultations to implementation to long term operation and maintenance. This model involves the inclusion of minimum service levels and long-term maintenance warranties into contracts to ensure that systems are designed to work as intended and to last for many years to come."
    },
    {
        "look_id": 1259,
        "keywords": [
            "Transnomis",
            "service offerings",
            "ITS Central",
            "Advanced Traffic Management System",
            "VMS Central",
            "Smart Work Zones",
            "Municipal 511",
            "Permit Central",
            "web application"
        ],
        "answer_text": "Transnomis packaged service offerings includes 1) ITS Central – a map-centric Advanced Traffic Management System (ATMS) central software, 2) VMS Central - cloud-hosted solution available to work zone traffic safety companies, allowing them to configure and create their own 'Smart Work Zones.', 3) Municipal 511 - cloud-hosted and shared platform available to municipalities of all sizes to communicate and manage their road events and emergency responses, 4) Permit Central - a web application that provides a user interface for the public to create a permit application online and for staff to manage the approval process."
    },
    {
        "look_id": 1261,
        "keywords": [
            "job cost control",
            "Oracle JD Edwards",
            "project financials",
            "budget tracking",
            "cost control"
        ],
        "answer_text": "B&M utilizes a well-defined and monitored job cost control system using Oracle’s JD Edwards (JDE) which acts as an early warning system to enable the Project Manager to review live project financials at any given moment, unlike some elaborate systems which provide little more than historical data long after opportunities for value engineering have passed. B&M objectives of job cost control for tracking and maintaining project budgets include: To monitor planned, incurred and anticipated project expenditures; To control the cost of construction; To provide ongoing forecasts of the project’s financial outcome; and To maintain effective records which provide the results of good and bad estimates so that adjustments can be made in labour productivity factors, and project methodology."
    },
    {
        "look_id": 1263,
        "keywords": [
            "stakeholder management",
            "Project Managers",
            "stakeholder plan",
            "project risks",
            "focus groups"
        ],
        "answer_text": "B&M understands that effective stakeholder management is a key skill for our Project Managers who are accountable for end-to-end project management and execution. B&M creates a stakeholder plan that identifies the stakeholders, discusses goals, determines work methods and identifies project/work scope risks. Key stakeholders are invited to participate in steering committees, focus groups, gate reviews, or other project meetings or milestones."
    },
    {
        "look_id": 1264,
        "keywords": [
            "stakeholder plan",
            "goals",
            "work methods",
            "project risks",
            "steering committees"
        ],
        "answer_text": "B&M creates a stakeholder plan that identifies the stakeholders, discusses goals, determines work methods and identifies project/work scope risks. Key stakeholders are invited to participate in steering committees, focus groups, gate reviews, or other project meetings or milestones."
    },
    {
        "look_id": 1266,
        "keywords": [
            "SharePoint",
            "Citrix ShareFile",
            "document management",
            "secure sharing"
        ],
        "answer_text": "B&M maintains a flow of project documents through SharePoint website as an official repository for soft documents, reports, and files. B&M also uses Citrix ShareFile to securely share documents with clients if required."
    },
    {
        "look_id": 1268,
        "keywords": [
            "Environment/Health and Safety Inspector",
            "site safety",
            "safety meetings",
            "incident reporting"
        ],
        "answer_text": "Jim McNeil has been designated as the Environment/Health and Safety Inspector for this contract. Jim will report to Alicia (Project Manager) for the duration of this contract. Jim McNeil’ roles and responsibilities on this project include to oversee site safety, train on site employees, coordinate safety meetings, and ensure incidents are recognized, investigated, analyzed and reported in a timely/valued manner."
    },
    {
        "look_id": 1270,
        "keywords": [
            "Quality Assurance",
            "Quality Control",
            "Policy",
            "Program",
            "Efficiency",
            "Project Costs",
            "Training",
            "IMSA Certification",
            "ITS Infrastructure",
            "MTO Infrastructure"
        ],
        "answer_text": "B&M has a Quality Assurance / Quality Control Policy and Program in place that will comply with our client's Quality Management needs' principles and objectives. Our Program was established to fulfill, and then surpass, our client's quality assurance standards through continual evaluation and improvement. The goal of B&M's Program is to increase efficiency and lower project costs while maintaining the highest level of quality in every performed work. Through training sessions, seminars, access to educational resources, and IMSA certification courses, B&M promotes quality work by developing and maintaining our workforce knowledge. The B&M management team and field crews assigned to this contract have extensive expertise of ITS infrastructure as well as MTO infrastructure and procedures. We have demonstrated the efficiency of our services on past projects/maintenance contracts, and our services does not include any back charges."
    },
    {
        "look_id": 1265,
        "keywords": [
            "reporting structure",
            "Project Manager",
            "Microsoft Project",
            "Project Scheduler"
        ],
        "answer_text": "B&M will implement a reporting structure starting from the Project Manager going down to the Project Foreman and will be expand to include other project parties. We manage our project schedule through Microsoft Project and assign a single Project Scheduler to manage the float in schedule."
    },
    {
        "look_id": 1267,
        "keywords": [
            "job cost control",
            "JD Edward's",
            "mid-course corrections",
            "live project financials"
        ],
        "answer_text": "B&M utilizes a well-defined and monitored job cost control system using JD Edward’s (JDE) to justify mid-course corrections necessary for bringing the job on time and within budget. It enables the Project Manager to review live project financials at any given moment."
    },
    {
        "look_id": 1269,
        "keywords": [
            "Simon Foo",
            "CEO",
            "ITS Central Software Solution",
            "TMC operations",
            "ITS device integration"
        ],
        "answer_text": "Simon Foo is the owner, founder, and CEO of Transnomis Solutions. He has degrees in Computer, Electrical, and Civil Engineering, and solid experience in TMC operations, and ITS device integration. Simon personally architected and developed the ITS Central Software Solution, proposed for this project."
    },
    {
        "look_id": 1271,
        "keywords": [
            "On-time",
            "On-budget",
            "Microsoft Project",
            "Project Scheduler",
            "Baseline Schedules",
            "Critical Path",
            "Project Manager"
        ],
        "answer_text": "B&M prioritises on-time and on-budget project completion and uses Microsoft Project to achieve this goal. It enables all of the associated requirements, milestones, and ultimate completion dates involved in the completion of the project delivered through an integrated team method to be mutually established and easily updated. Every project is assigned to a dedicated Project Scheduler who is primarily responsible for assisting the Project Manager in scheduling activities such as creating baseline schedules, updating schedules weekly or biweekly to integrate change orders, defining and monitoring the Critical Path of the project, and rising any anticipated delays issues to the Project Manager."
    },
    {
        "look_id": 1272,
        "keywords": [
            "installation",
            "infrastructure",
            "OPSS",
            "OPSD",
            "mitigation"
        ],
        "answer_text": "All the documents and constructions tasks will be reviewed by designer and project quality controller coordinator to ensure there is no deviation from OPSS and OPSD."
    },
    {
        "look_id": 1274,
        "keywords": [
            "ITS equipment",
            "testing",
            "installation"
        ],
        "answer_text": "All ITS equipment including BT readers and communication infrastructure will be thoroughly tested prior to installation."
    },
    {
        "look_id": 1276,
        "keywords": [
            "PIT",
            "POP",
            "testing",
            "performance standards"
        ],
        "answer_text": "Pre-Installation Testing (PIT) will include all PIT tests required in the Special Provision for each ATMS element, and will be conducted prior to the installation of the components. After installation, Proof of Performance (POP) testing will test each component and subsystem individually, confirming that the unit meets the performance standards."
    },
    {
        "look_id": 1278,
        "keywords": [
            "traffic control",
            "public safety",
            "traffic management",
            "B&M"
        ],
        "answer_text": "The main purpose of modal transportation networks is to guarantee a safe and efficient traffic movement for public on highways and roadways. B&M has in place a Public Protection & Traffic Management Planning tenet to make sure B&M authorized employees comprehend the necessities for and to provide protection for workers and the public by regulating traffic flow and implementing efficient traffic control plans."
    },
    {
        "look_id": 1273,
        "keywords": [
            "material",
            "selection",
            "approval",
            "design package"
        ],
        "answer_text": "All material shop drawing will be submitted to the designer for their review and approval prior to place orders to supplier. The material selection document will be submitted to the Ministry as part of the project design package."
    },
    {
        "look_id": 1275,
        "keywords": [
            "system testing",
            "software errors",
            "MTO processes",
            "test plan"
        ],
        "answer_text": "Comprehensive System Testing will also mitigate risks of software errors and issues. The project will undergo comprehensive testing, in adherence with standard MTO processes. A formal Test plan will be prepared and submitted for review and approval that will document the tests to be performed and the expected results."
    },
    {
        "look_id": 1277,
        "keywords": [
            "SIT",
            "system integration",
            "testing",
            "operational"
        ],
        "answer_text": "When all POP testing is completed, and every element of the system is operational, the system can undergo System Integration Testing (SIT) to ensure that the entire system operates correctly when it is fully online."
    },
    {
        "look_id": 1279,
        "keywords": [
            "occupational health",
            "safety",
            "workplace",
            "B&M"
        ],
        "answer_text": "B&M believes that the measures we take will help drive B&M closer to our vision of a workplace where 'Nobody Gets Hurt Today or Tomorrow'. Our management team is committed to putting our people first in meeting our customer’s challenges in the most critical environments."
    },
    {
        "look_id": 1280,
        "keywords": [
            "Occupational Health and Safety",
            "workplace safety",
            "risk management",
            "HSE commitment"
        ],
        "answer_text": "B&M believes that the measures we take will help drive B&M closer to our vision of a workplace where “Nobody Gets Hurt Today or Tomorrow”. Our management team is committed to putting our people first in meeting our customer’s challenges in the most critical environments. B&M believes the most effective way to avoid any potential risks to people and the environment and to meet our HSE commitment is through a competent, committed workforce and practices designed to ensure the resultant risk is effectively managed proactively. We accomplish this by effective implementation of our Hazard Identification Elimination Risk Assessment & Control (HIERAC) processes and B&M HSE Manual."
    },
    {
        "look_id": 1282,
        "keywords": [
            "Travel Time system",
            "data processing",
            "Bluetooth",
            "Wi-Fi",
            "MAC addresses"
        ],
        "answer_text": "The sensors will read the MAC addresses of detected devices (Bluetooth & Wi-Fi) as they pass through the sensor’s detection radius (minimum 100m). Device MAC addresses are hashed and encrypted and sent to ITS Central software instance via local LTE modem connection. ITS Central receives hashed MAC addresses continuously from all sensors and processes the data into matches in order to calculate link travel time data."
    },
    {
        "look_id": 1284,
        "keywords": [
            "Bluetooth detection",
            "Wi-Fi detection",
            "non-metallic enclosure",
            "weatherproof antennas"
        ],
        "answer_text": "These devices are integrated into a non-metallic enclosure to provide the integrated all-in-one solution The Ministry has requested. They will utilize external weatherproof omni directional antennas for long range and robust detection for highway environments. Each transceiver will have a dedicated antenna (1 for Bluetooth, 1 for Wi-Fi) in order to maximize detection quality."
    },
    {
        "look_id": 1286,
        "keywords": [
            "Stinson AIS",
            "ease of installation",
            "configuration",
            "sensor variants",
            "power supply system"
        ],
        "answer_text": "When designing the Stinson AIS, ease of installation and configuration were two key factors we focused on throughout the process. With this in mind, we developed two sensor variants for installation in any environment: a compact shelf mount unit when cabinet space is critical and a standalone weatherproof pole mount unit when no cabinet or infrastructure is available. To further ease the simplicity of installation we have designed a flexible power supply system which makes it possible to install this device nearly anywhere."
    },
    {
        "look_id": 1281,
        "keywords": [
            "safety training",
            "tailboard safety meetings",
            "traffic control",
            "safety protocols"
        ],
        "answer_text": "All field crew members will have mandatory safety training refresher courses delivered. No crew member will be permitted to work on the contract without providing proof of training. Daily tailboard safety meetings will be conducted at the yard prior to arrival on-site. Daily meetings will review the work to be conducted, the traffic control plan staging, safety protocols and coordination with vendors or technical support."
    },
    {
        "look_id": 1283,
        "keywords": [
            "data feeds",
            "travel time information",
            "VMS",
            "data sharing agreements"
        ],
        "answer_text": "MTO will receive the data feeds, and can use the data to display travel time information on VMS. Future data sharing agreements may be reached during the Term of Agreement, per Article 3."
    },
    {
        "look_id": 1285,
        "keywords": [
            "Stinson AIS",
            "MTO project",
            "Bluetooth detection devices",
            "accuracy",
            "penetration rates",
            "industry standards"
        ],
        "answer_text": "The Stinson AIS participated in an MTO project in 2016 to test a variety of alternative Bluetooth detection devices to determine their accuracy and penetration rates. This testing was performed on Hwy 26 near Wasaga Beach and involved three vendor devices: Iteris Vantage, ISS Deep Blue, and the Stinson AIS. WSP performed the testing and evaluation which focused on the Accuracy and Penetration rate of each sensor to determine if they met industry standards. The results of the testing confirmed that the Stinson AIS met industry standards for both metrics and as such were well suited for travel time applications on roadways."
    },
    {
        "look_id": 1287,
        "keywords": [
            "OVH",
            "hosting services",
            "data centers",
            "certifications",
            "security"
        ],
        "answer_text": "For hosting, we propose the services of OVH. It is one of the largest internet hosting companies in the world, with 400,000 servers, 33 data centers in 4 continents and 1.6 million customers. It is fully certified: PCI DSS, ISO/IEC 27001, 27017, 27018, 27701, 50001, SOC 1, SOC 2 and SOC 3, Cloud Security Alliance STAR certified. OVH.com has a data center in Beauharnois, QC. Its facility is highly secure with access only by authorized employees. It has technician and security on-site 24/7."
    },
    {
        "look_id": 1288,
        "keywords": [
            "Transnomis Solutions",
            "hosting",
            "software service",
            "responsibility",
            "single point of contact"
        ],
        "answer_text": "Although hosting is provided by reliable third party, Transnomis Solutions is fully responsible for the availability of its software service. The Ministry will never have to deal with the hosting company. Transnomis Solutions will be the single point of contact for all issues related to services provided for this contract, including server availability issues."
    },
    {
        "look_id": 1290,
        "keywords": [
            "uptime",
            "99%",
            "maintenance"
        ],
        "answer_text": "The Solution shall have a continuous monthly uptime of at minimum 99% outside of any scheduled and routine maintenance."
    },
    {
        "look_id": 1292,
        "keywords": [
            "remote access",
            "TT System",
            "GUI",
            "secured manner"
        ],
        "answer_text": "The Proponent shall provide remote access to the TT System Graphical User Interface (GUI) to authorized MTO users in a secured manner."
    },
    {
        "look_id": 1294,
        "keywords": [
            "collaboration",
            "IPSec VPN",
            "MTO firewall"
        ],
        "answer_text": "The Proponent shall collaborate with MTO to establish a site-to-site IPSec VPN tunnel between the system and MTO firewall."
    },
    {
        "look_id": 1289,
        "keywords": [
            "real-time",
            "travel time",
            "data feeds",
            "continuous operation"
        ],
        "answer_text": "The Solution shall operate and publish real-time travel time data feeds continuously (i.e. 24/7, 365 days)."
    },
    {
        "look_id": 1291,
        "keywords": [
            "backup",
            "redundancy",
            "system failure"
        ],
        "answer_text": "The Solution shall have backup or redundancy procedures in place in order to resume normal operations upon system failure."
    },
    {
        "look_id": 1293,
        "keywords": [
            "user access",
            "privileges",
            "functional level",
            "roles"
        ],
        "answer_text": "User access privileges shall be definable on a functional level. This shall allow for different levels and roles of users to access system features and functions."
    },
    {
        "look_id": 1295,
        "keywords": [
            "data processing",
            "travel time information"
        ],
        "answer_text": "The Solution shall support all data processing procedures required for the development of travel time information."
    },
    {
        "look_id": 1296,
        "keywords": [
            "real-time",
            "secured data feeds",
            "Link-based TT",
            "Route-based TT",
            "Sign-based TT"
        ],
        "answer_text": "The Solution shall generate three (3) real-time secured data feeds: Link-based TT – TT between two adjacent BT; Route-based TT – TT between VMS and the displayed destination; and Sign-based TT message – for each destination defined for VMS."
    },
    {
        "look_id": 1298,
        "keywords": [
            "data feeds",
            "sharable",
            "partners",
            "MTO"
        ],
        "answer_text": "Data feeds generated by the solution shall be sharable with partners as defined by MTO."
    },
    {
        "look_id": 1300,
        "keywords": [
            "GUI",
            "user-accessible",
            "reporting system"
        ],
        "answer_text": "The GUI shall consist of a user-accessible reporting system."
    },
    {
        "look_id": 1302,
        "keywords": [
            "dashboard",
            "buffer time index",
            "BTI",
            "links",
            "routes"
        ],
        "answer_text": "The dashboard shall provide information on buffer time index (BTI) for links and routes. BTI = (TT (95th percentile) – TT (real-time)) / TT (real-time)."
    },
    {
        "look_id": 1297,
        "keywords": [
            "maintenance",
            "responsibility",
            "solution",
            "agreement"
        ],
        "answer_text": "The Proponent shall be responsible for all maintenance of the Solution during the Term of Agreement."
    },
    {
        "look_id": 1299,
        "keywords": [
            "reporting system",
            "automatically generate",
            "daily",
            "weekly",
            "monthly",
            "ranking",
            "average speed",
            "average travel time"
        ],
        "answer_text": "The reporting system shall automatically generate the following reports on a daily, weekly, and monthly basis, and archive these reports: Ranking of routes by average speed; and Ranking of routes by average travel time per kilometre."
    },
    {
        "look_id": 1301,
        "keywords": [
            "dashboard",
            "travel time index",
            "TTI",
            "links",
            "routes"
        ],
        "answer_text": "The dashboard shall provide information on travel time index (TTI) for links and routes. TTI = TT (real-time) / TT (free-flow)."
    },
    {
        "look_id": 1303,
        "keywords": [
            "ITS Central",
            "Advanced Traffic Management System",
            "data retrieval",
            "Bluetooth Readers",
            "field devices"
        ],
        "answer_text": "Transnomis’ ITS Central software is currently installed as the Advanced Traffic Management System in the City of Edmonton, Region of York, Region of Durham, MTO East Region, and BC Ferries. In addition, ITS Central is the control software being used for MTO’s Queue and Stopped Vehicle Advisory System (QSVAS) on Highway 405, which is currently in the Operational Performance Test (OPT) period. ITS Central specializes in retrieving data and device status information from the field devices it’s integrated with, including the Stinson AIS Bluetooth/WiFi sensor, cellular modems, CCTV cameras, variable message signs, vehicle detectors, traffic signals, and various weather detection equipment (e.g., atmospheric sensors, wind meters, pavement sensors, etc.)."
    },
    {
        "look_id": 1327,
        "keywords": [
            "software updates",
            "ITS Central",
            "maintenance",
            "Term of Agreement"
        ],
        "answer_text": "Transnomis will keep the ITS Central software up to date with the latest available software updates for the duration of the Term of Agreement."
    },
    {
        "look_id": 1304,
        "keywords": [
            "data processing",
            "travel time information",
            "MTO defined formats"
        ],
        "answer_text": "ITS Central is able to process the raw data (MAC addresses retrieved from the sensors) into travel time information, per the MTO defined formats."
    },
    {
        "look_id": 1306,
        "keywords": [
            "scalability",
            "geographic expansion",
            "Bluetooth readers",
            "VMS"
        ],
        "answer_text": "ITS Central is designed to be fully scalable, to include future geographic expansion and inclusion of additional routes. In addition, adding additional Bluetooth readers and VMS’s is a common request by our previous clients, and can be easily accommodated."
    },
    {
        "look_id": 1305,
        "keywords": [
            "data publication",
            "secured data feeds",
            "public API",
            "system integration"
        ],
        "answer_text": "ITS Central publishes processed data to an XML file using HTTPS secured data feeds, allowing for a secured public API for future system integration and data sharing within MTO and with other jurisdictions. Permissions may be granted by the system administrator for access to the secured data feeds."
    },
    {
        "look_id": 1307,
        "keywords": [
            "ITS Central",
            "continuous operation",
            "real-time travel time data"
        ],
        "answer_text": "Our ITS Central software is designed to operate continuously, 24/7/365. Our ITS Central Advanced Traffic Management Systems in the City of Edmonton, Region of York, Region of Durham, MTO East Region, and BC Ferries operate continuously (24/7/365). MTO’s QSVAS is also designed for continuous operations. Our systems in Toronto, Oklahoma, and California are also running 24/7/365."
    },
    {
        "look_id": 1308,
        "keywords": [
            "99% uptime",
            "triple servers",
            "OVH",
            "redundancy"
        ],
        "answer_text": "Professional third-party hosting, and triple servers are proposed to achieve 99% uptime, with an expected uptime of better than 99.99% excluding scheduled maintenance. A total of 3 servers, hosted professionally by OVH within Canada, will be utilized in this project to achieve full system triple redundancy and fail-over."
    },
    {
        "look_id": 1309,
        "keywords": [
            "remote access",
            "ITS Central",
            "user permissions",
            "HTTPS"
        ],
        "answer_text": "Transnomis’ ITS Central software allows for browser-based access, secured by HTTPS, password-based login, and user group permissions. User rights are managed by user groups, and users are assigned to one or more user groups. The permissions the user has is the aggregation of all of the permissions of the groups the user belongs to."
    },
    {
        "look_id": 1310,
        "keywords": [
            "GO ITS",
            "security requirements",
            "ITS Central"
        ],
        "answer_text": "ITS Central complies with all Government of Ontario Information Technology Standards security requirements."
    },
    {
        "look_id": 1312,
        "keywords": [
            "user access",
            "functional level",
            "user groups"
        ],
        "answer_text": "User access privileges are definable on a functional level. User rights are managed by user groups, and users are assigned to one or more user groups. The permissions the user has is the aggregation of all of the permissions of the groups the user belongs to."
    },
    {
        "look_id": 1314,
        "keywords": [
            "automatic infill",
            "Bluetooth reader failure",
            "travel time",
            "data processing"
        ],
        "answer_text": "The Proponent shall automatically infill route travel time information in the event of an origin Bluetooth reader failure. When ITS Central detects the restoration of communication to the sensor (regardless if it is an origin, destination or intermediate reader), it automatically downloads the archived data files needed from the sensor, and re-process the Bluetooth/Wi-Fi data by matching with data from other sensors, and re-computing the travel time data."
    },
    {
        "look_id": 1316,
        "keywords": [
            "slow traffic condition",
            "real-time",
            "MTO definition",
            "measured speed"
        ],
        "answer_text": "The Solution shall have the ability to identify real-time route travel time as slow traffic condition as per MTO definition. ITS Central can identify slow traffic conditions, per MTO's definition based on measured speed."
    },
    {
        "look_id": 1311,
        "keywords": [
            "Freedom of Information",
            "privacy guidelines",
            "Ontario"
        ],
        "answer_text": "All end-to-end services of this system comply with the guidelines in the Freedom of Information and Protection of Privacy Manual published by the Government of Ontario."
    },
    {
        "look_id": 1313,
        "keywords": [
            "data filtering",
            "anomalies",
            "outliers",
            "statistical methods",
            "algorithmic calculation"
        ],
        "answer_text": "The Solution shall be capable of filtering data to remove anomalies, outliers, and encrypted MAC IDs unmatched to a destination using robust statistical methods. ITS Central employs advanced algorithmic calculation of travel times between sensors by aggregating and filtering the raw travel time data eliminating aberrations and outliers. The parameters for this algorithm are configurable."
    },
    {
        "look_id": 1315,
        "keywords": [
            "configurable time period",
            "route travel time",
            "VMS",
            "default time period"
        ],
        "answer_text": "ITS Central allows MTO to define a configurable time period during which MTO will publish route travel time messages on VMS. The initial default time period shall be: • Weekdays (Monday to Friday) – 6:00am to 10:00am, 3:00pm to 8:00pm; and • Weekends (Saturday and Sunday) and statutory holidays – 9:00am to 12:00pm, 5:00pm to 9:00pm. These time periods are easily configurable."
    },
    {
        "look_id": 1317,
        "keywords": [
            "data hosting",
            "cloud-based solution",
            "OVH",
            "certifications",
            "Canada"
        ],
        "answer_text": "Data shall be hosted and stored by the Proponent within Canada utilizing cloud-based solution, outside of MTO premises. For hosting, we propose the services of OVH (https://www.ovh.com/). It is one of the largest internet hosting companies in the world, with 400,000 servers, 33 data centers in 4 continents and 1.6 million customers. It is fully certified: PCI DSS, ISO/IEC 27001, 27017, 27018, 27701, 50001, SOC 1, SOC 2 and SOC 3, Cloud Security Alliance STAR certified."
    },
    {
        "look_id": 1318,
        "keywords": [
            "responsibility",
            "software service",
            "single point of contact",
            "server availability"
        ],
        "answer_text": "Although hosting is provided by reliable third party, Transnomis Solutions is fully responsible for the availability of its software service. The Ministry will never have to deal with the hosting company. Transnomis Solutions will be the single point of contact for all issues related to services provided for this contract, including server availability issues."
    },
    {
        "look_id": 1320,
        "keywords": [
            "dashboard",
            "real-time travel time",
            "hardware information",
            "ITS Central"
        ],
        "answer_text": "The GUI shall provide a dashboard for MTO to access real-time travel time and hardware (Bluetooth reader, VMS) information. ITS Central includes a robust configurable dashboard that can display real-time travel time, and hardware/maintenance issues."
    },
    {
        "look_id": 1322,
        "keywords": [
            "map license",
            "Transnomis",
            "responsibility",
            "contracted agreement"
        ],
        "answer_text": "Transnomis will be responsible for obtaining and renewing the map license throughout the duration of the contracted agreement period."
    },
    {
        "look_id": 1324,
        "keywords": [
            "reports",
            "printer friendly",
            "customization",
            "MTO needs"
        ],
        "answer_text": "Reports are preconfigured to be printer friendly and organized. It is anticipated that some further customization and feedback from MTO will be needed to ensure reports meet MTO’s needs."
    },
    {
        "look_id": 1319,
        "keywords": [
            "historical data",
            "aggregated travel time",
            "contract duration",
            "ITS Central"
        ],
        "answer_text": "Historical aggregated travel time information shall be stored and accessible to users for the duration of the Contract. Historical aggregated travel time information is stored in ITS Central's database, and will be accessible for the duration of the contract."
    },
    {
        "look_id": 1321,
        "keywords": [
            "TTI",
            "BTI",
            "travel time index",
            "buffer time index",
            "links",
            "routes"
        ],
        "answer_text": "The dashboard display provides the information on TTI and BTI for each link and route. TTI = TT (real-time) / TT (free-flow). BTI = (TT (95th percentile) – TT (real-time)) / TT (real-time)."
    },
    {
        "look_id": 1323,
        "keywords": [
            "reporting system",
            "filters",
            "time periods",
            "regions",
            "paths",
            "devices"
        ],
        "answer_text": "The reporting system includes filters to define the time periods, regions, paths, and devices."
    },
    {
        "look_id": 1325,
        "keywords": [
            "data feeds",
            "partners",
            "access",
            "MTO"
        ],
        "answer_text": "Transnomis will setup access to the data feeds for partners who require access, as requested and authorized by MTO."
    },
    {
        "look_id": 1336,
        "keywords": [
            "Scheduled System Maintenance Plan",
            "MTO approval",
            "staff responsibilities",
            "operating guidelines",
            "routine maintenance procedures"
        ],
        "answer_text": "A Scheduled System Maintenance Plan will be submitted to the MTO for approval one month prior to SLA initiation. This plan will indicate all staff, staff responsibilities, resources, schedules and operating guidelines. The plan shall include a description of the processes and tasks required to carry out the Operations, Maintenance and Support of the TT Service including the procedures that address requirements of subsections 1.4.1, 1.4.2 and 1.4.3 of the SLA document. All asset locations will be included on a detailed map. Access to each asset location will be included along with a list of all potential safety hazards and traffic control requirements. In depth routine maintenance procedures will be outlined for all assets in the project inventory. Routine maintenance details and activity sequences will be in accordance with the agreed contract, previous routine maintenance experience and field information from on-site inspections."
    },
    {
        "look_id": 1326,
        "keywords": [
            "changes",
            "processes",
            "methodologies",
            "documentation",
            "MTO approval"
        ],
        "answer_text": "Transnomis will provide notice and advance documentation of changes to processes and methodologies during the Term of Agreement. MTO will test and approve these changes at their discretion."
    },
    {
        "look_id": 1328,
        "keywords": [
            "bug patches",
            "ITS Central",
            "maintenance",
            "Central Region"
        ],
        "answer_text": "Transnomis will provide bug patches for the Central Region ITS Central as the patches are rolled out."
    },
    {
        "look_id": 1330,
        "keywords": [
            "automatic transfer",
            "configuration file",
            "MTO",
            "monthly"
        ],
        "answer_text": "Transnomis will work with MTO to setup the automatic transfer of the configuration file to MTO on the last business day of every month."
    },
    {
        "look_id": 1332,
        "keywords": [
            "real-time monitoring",
            "Bluetooth Readers",
            "alerts",
            "maintenance"
        ],
        "answer_text": "ITS Central monitors the status of the AIS Stinson Bluetooth/Wifi readers in real time, and provides alert on the map interface as well as email notifications if the device requires maintenance."
    },
    {
        "look_id": 1334,
        "keywords": [
            "monitoring",
            "ITS components",
            "MTO",
            "device failure",
            "incident documentation"
        ],
        "answer_text": "During the operational and maintenance phases of the contract, Black & McDonald will be responsible for monitoring the operation of all ITS components including BT readers installed under the contract. B&M will immediately notify the MTO if any MTO-supplied material or equipment (existing or new) is discovered to be broken or faulty, affecting system performance. Field devices will be monitored by ITS Central, and notifications will be sent to B&M if a device failure is detected. In line with the Agreement, the MTO will decide on a course of action with respect to such material or equipment. When Black & McDonald Limited is notified of an occurrence, it must respond within the specified time frame. Any incidents will be documented in detail and reported to the MTO, with a summary of the root cause and corrective action taken."
    },
    {
        "look_id": 1329,
        "keywords": [
            "SLA",
            "operational procedures",
            "MTO",
            "service configurations"
        ],
        "answer_text": "The project team will refer to the SLA for operational procedures to process requests by MTO to make changes to the service configurations listed above."
    },
    {
        "look_id": 1331,
        "keywords": [
            "reports",
            "Bluetooth Readers",
            "status",
            "daily",
            "weekly",
            "monthly"
        ],
        "answer_text": "ITS Central will generate daily, weekly, and monthly reports on the status of the Bluetooth Readers."
    },
    {
        "look_id": 1333,
        "keywords": [
            "Black & McDonald",
            "System Operational Support",
            "Warranty",
            "System Emergency Repairs",
            "System Routine Maintenance",
            "Service Level Agreement"
        ],
        "answer_text": "Black & McDonald (B&M) will be responsible for System Operational Support, Warranty, System Emergency Repairs, and System Routine Maintenance for the TT system. B&M will maintain fault free operation of the TT system including the hardware and software parts as well as maintaining effective working conditions according to the contract’s specifications. B&M project management team will review the restrictions outline in Appendix C3 and create a maintenance plan based on information provided. The maintenance team will carry out successful coordination with any other contractors to stay away from working in the same area by providing the advanced notice to the contract administrator or representative from general contractors. All activities will follow the requirements specified in the Service Level Agreement to ensure equipment and system performance levels are met throughout the life of the Contract."
    },
    {
        "look_id": 1335,
        "keywords": [
            "project management",
            "SLA execution plan",
            "Full Deployment System Acceptance",
            "Operability Period",
            "meeting minutes"
        ],
        "answer_text": "To establish a proper project management practices and to ensure they are implemented and maintained for the 5 years-term duration of this contract and as per the SLA execution plan. Also, to introduce SLA personnel administrator and technical support staff to exchange contact information with MTO. Approach and Methodology: Once a successful completion of the Full Deployment System Acceptance is achieved as well as the Operability Period, a project maintenance meeting will begin between the MTO and the project assigned team. Questions, comments or concerns from either party will be addressed during this meeting and a detailed record of the minutes of the meeting will be retained for future reference."
    },
    {
        "look_id": 1337,
        "keywords": [
            "safety management plan",
            "environmental management plan",
            "MTO review",
            "risk mitigation",
            "environmental protection strategy"
        ],
        "answer_text": "A comprehensive project safety and environmental management plan will be developed and submitted to the MTO for review. The project's safety and environmental protection plan will go through site-specific safety hazards, risk mitigation measures, and environmental protection strategy, as well as a list of all hospitals and clinics in the area. All environmental work will be conducted in compliance with MTO Environmental Reference of Highway Design regulations (ERD). This plan will be reviewed by the project's management team before submitting it to the MTO for approval. The Project's Safety and Environmental Management Plan must be followed by all project personnel, including office employees and field crews. Throughout the contract, this plan will be updated and maintained."
    },
    {
        "look_id": 1338,
        "keywords": [
            "routine maintenance",
            "Scheduled System Maintenance Plan",
            "TT system components",
            "SLA compliance",
            "ITS maintenance"
        ],
        "answer_text": "Routine maintenance services will be scheduled in accordance to the approved Scheduled System Maintenance Plan. It will be conducted for all TT system components within the contract limits. Routine maintenance and inspection services will comply with the Equipment Specific Scheduled Maintenance Requirements outline in the SLA, manufacture recommendations and be in accordance with the ITS elements and operation and maintenance manuals. Any ITS maintenance work related to the upgrade of system components will be reviewed by approved MTO consultants and all products used for upgrades will meet the applicable project agreement requirements, in accordance with the Designated Source Material (DSM) List."
    },
    {
        "look_id": 1340,
        "keywords": [
            "monthly service reports",
            "template",
            "MTO",
            "invoice"
        ],
        "answer_text": "The project team will prepare a template for monthly field maintenance service. The template will be completed on a monthly basis, based on maintenance services provided and submitted to the MTO. Monthly Reports will be accompanied by each invoice."
    },
    {
        "look_id": 1342,
        "keywords": [
            "emergency dispatch center",
            "contact list",
            "equipment management",
            "material management"
        ],
        "answer_text": "To construct a 24-hour emergency dispatch center. Give the dispatch center and all on-call emergency workers a contact list from MTO. Make a plan for managing equipment and material."
    },
    {
        "look_id": 1344,
        "keywords": [
            "non-routine maintenance log book",
            "repair tracking",
            "ITS asset",
            "information management"
        ],
        "answer_text": "For all call out actions, the non-routine maintenance log book will be updated every time an attendance to an electrical or ITS asset is made. Crews will keep track of when the repair was finished and when the component was fully functional."
    },
    {
        "look_id": 1339,
        "keywords": [
            "document control system",
            "routine maintenance reports",
            "electronic ticketing system",
            "system performance",
            "monthly invoice"
        ],
        "answer_text": "To create a document control system to guarantee that all routine maintenance reports are completed, structured, and available to the MTO. To put in place an electronic ticketing system to track, manage, and respond to system outages and other operational concerns. To monitor and record monthly system performance, ensuring system performance metric and submitted to the MTO each month along with the monthly invoice."
    },
    {
        "look_id": 1341,
        "keywords": [
            "electronic ticketing system",
            "system outages",
            "trouble tickets",
            "resolution"
        ],
        "answer_text": "The project team will implement an electronic ticketing system which logs and reports system outages or equipment operation issues. Trouble tickets will be assigned a number, priority level and technician responsible for resolution. Upon resolution, the ticket will be updated to indicate the outcome, resolution details and lessons learned."
    },
    {
        "look_id": 1343,
        "keywords": [
            "on-call crew",
            "emergency call",
            "dispatch center",
            "service truck"
        ],
        "answer_text": "The on-call crew will be briefed on the category of the call and sent after receiving an emergency call at either the 24/7 hour dispatch center or via the list of contacts provided to the MTO. On-call crew will have access to a service truck and some supplies from their home base."
    },
    {
        "look_id": 1346,
        "keywords": [
            "routine maintenance",
            "emergency services",
            "48 months",
            "electronic ticketing system",
            "system faults"
        ],
        "answer_text": "Upon construction of the GCSS System, B&M will assume ongoing routine maintenance and emergency services for a duration of 48 months. The project team will implement an electronic ticketing system to ensure system faults are tracked and resolved within the contract timeframes."
    },
    {
        "look_id": 1345,
        "keywords": [
            "safety",
            "high accuracy",
            "uptime",
            "redundancy",
            "fail-safe features",
            "external monitoring",
            "availability"
        ],
        "answer_text": "As safety is the top priority for the GCSS System, it is critical that the GCSS System operates with high accuracy and uptime. It is our objective to design a system which promotes redundancy and fail-safe features to maintain consistent operation. System uptime will also be monitored by an external service to ensure 99.95% availability of the GCSS."
    },
    {
        "look_id": 1347,
        "keywords": [
            "production environment",
            "tested software",
            "accepted versions"
        ],
        "answer_text": "The system shall have a production environment that is exclusively used for production purposes and provides the most recent tested and accepted versions of the system modules. We will install our tested, accepted and released software on the production environment for production purposes only."
    },
    {
        "look_id": 1349,
        "keywords": [
            "version control",
            "rollback",
            "previous versions"
        ],
        "answer_text": "All Transnomis software has version control such that it is easy to roll back to previous versions."
    },
    {
        "look_id": 1351,
        "keywords": [
            "user accounts",
            "no limit"
        ],
        "answer_text": "ITS Central has no limit to the number of user accounts."
    },
    {
        "look_id": 1348,
        "keywords": [
            "testing environment",
            "separate from production",
            "system functionalities",
            "UDOT staff"
        ],
        "answer_text": "The system shall provide a testing environment separate from the production environment that is available for testing and demonstrating all system functionalities and upgrades without impacting the performance or functionality of the production system. This environment is intended for UDOT staff to test features and functionality, and not as a development environment for the vendor."
    },
    {
        "look_id": 1350,
        "keywords": [
            "scalable",
            "connected devices"
        ],
        "answer_text": "ITS Central is highly scalable and will have no difficulty handling many thousands of connected devices."
    },
    {
        "look_id": 1352,
        "keywords": [
            "simultaneous users",
            "hundreds"
        ],
        "answer_text": "ITS Central can accommodate hundreds of simultaneous users."
    },
    {
        "look_id": 1354,
        "keywords": [
            "compliance",
            "Utah DTS security policies",
            "user access"
        ],
        "answer_text": "Transnomis will review and ensure compliance to Utah DTS security policies for user access, as we have with other governmental organizations."
    },
    {
        "look_id": 1353,
        "keywords": [
            "compliance",
            "Utah DTS policies"
        ],
        "answer_text": "Transnomis will review and ensure compliance to Utah DTS policies, as we have with other governmental organizations."
    },
    {
        "look_id": 1355,
        "keywords": [
            "Active Directory",
            "LDAP"
        ],
        "answer_text": "ITS Central integrates with Active Directory using LDAP(S)."
    },
    {
        "look_id": 1358,
        "keywords": [
            "user activity",
            "real-time",
            "administrators"
        ],
        "answer_text": "The system shall provide a means for administrators to view user activity in real-time. For example, an administrator will be able to view the current activities of other users logged into the system, either centrally or remotely. All user activity are logged and can be viewed in real-time by system administrators."
    },
    {
        "look_id": 1360,
        "keywords": [
            "real-time data feeds",
            "XML",
            "JSON"
        ],
        "answer_text": "ITS Central provides real-time data feeds in XML and JSON formats."
    },
    {
        "look_id": 1363,
        "keywords": [
            "data ingestion",
            "XML",
            "JSON",
            "GeoJSON"
        ],
        "answer_text": "ITS Central has ingested roadway information data from third-parties using XML, JSON and GeoJSON."
    },
    {
        "look_id": 1356,
        "keywords": [
            "customizable user roles",
            "permissions",
            "administrators"
        ],
        "answer_text": "ITS Central allows administrators to create and manage customizable user roles (a.k.a. user groups in ITS Central) and specific permissions are customized and assigned to each user roles so that they have exactly the permissions they need to perform the roles."
    },
    {
        "look_id": 1357,
        "keywords": [
            "manage permissions",
            "user group",
            "administrators"
        ],
        "answer_text": "ITS Central allows administrators to manage permissions of each user group, and assign users to that group."
    },
    {
        "look_id": 1359,
        "keywords": [
            "data retention",
            "configuration",
            "clients' policies"
        ],
        "answer_text": "ITS Central allows for configuration of the data retention length of time for each type of data (e.g., camera images, vehicle detector data, VMS messages, etc.) based on clients’ policies."
    },
    {
        "look_id": 1361,
        "keywords": [
            "data ingest",
            "third-party",
            "traffic data providers"
        ],
        "answer_text": "ITS Central has ingested data from third-party traffic data providers, including Google, Waze and TomTom."
    },
    {
        "look_id": 1362,
        "keywords": [
            "interface monitoring",
            "data feed",
            "notification"
        ],
        "answer_text": "When a data feed is not working as expected, ITS Central logs an issue into the system and generate notification (typically via email) to a configurable group of people so they can look into the issue."
    },
    {
        "look_id": 1364,
        "keywords": [
            "interface monitoring",
            "failure notification",
            "data feed issues"
        ],
        "answer_text": "The system shall monitor external interfaces and notify users of interface failures and errors. Examples of failures or errors include loss of connection or data not received by the system when expected. When a data feed is not working as expected, ITS Central logs an issue into the system and generates notification (typically via email) to a configurable group of people so they can look into the issue."
    },
    {
        "look_id": 1366,
        "keywords": [
            "user management",
            "permissions",
            "priority control"
        ],
        "answer_text": "The ATMS shall manage simultaneous implementations to control permissions and priority for devices and functionality based on user hierarchy across implementations. For example, the ATMS can give priority control of local devices to a user on a local implementation. ITS Central’s user group-based permission management plus permission assigned to ITS Central data layers provide for functionality as required here."
    },
    {
        "look_id": 1368,
        "keywords": [
            "image freshness",
            "current images",
            "capture frequency"
        ],
        "answer_text": "The Video Image Capture process shall ensure that all video images provided as 'current' are no older than 5 minutes. ITS Central can capture images as frequently as necessary (for one client it captures images every 30 seconds)."
    },
    {
        "look_id": 1365,
        "keywords": [
            "configurable monitoring",
            "notification frequency",
            "thresholds"
        ],
        "answer_text": "The system interface monitor shall be configurable to establish frequency of notifications, thresholds that trigger notifications and users to be notified. An example of a threshold may be defining that a notification is sent to users once an external system that typically exchanges data in real-time fails to exchange data for ten minutes. ITS Central retries the data exchange for a configurable period of time – if the failure persists over that period, it will log an issue and generate notification as described."
    },
    {
        "look_id": 1367,
        "keywords": [
            "video image capture",
            "live video streams",
            "still images"
        ],
        "answer_text": "The vendor shall provide a mechanism to capture still images from live video streams. ITS Central is capturing still images from various cameras for a number of its users."
    },
    {
        "look_id": 1369,
        "keywords": [
            "image archival",
            "configurable storage",
            "video streams"
        ],
        "answer_text": "The Video Image Capture process shall archive captured images for specific video streams for a customizable period of time. ITS Central can store camera images for a configurable period of time – configurable by individual cameras."
    },
    {
        "look_id": 1371,
        "keywords": [
            "data encryption",
            "at rest",
            "in transit",
            "VPN tunnels"
        ],
        "answer_text": "The ATMS Data Systems shall encrypt data at rest and in transit. ADR and ADX may be installed on a server storage with encryption. Data in transit will be encrypted if supported by the third-party devices. Encrypted VPN tunnels may be utilized as appropriate."
    },
    {
        "look_id": 1370,
        "keywords": [
            "data integration",
            "Panasonic Connected Vehicle System",
            "API development"
        ],
        "answer_text": "The system shall integrate aggregated data from the Panasonic Connected Vehicle System. This may include potential incidents, traffic speed data, and other potential data types. The API for this data is currently under development. The scope and fee for the development of this interface will be negotiated once the API is completed."
    },
    {
        "look_id": 1372,
        "keywords": [
            "operational independence",
            "ATMS software",
            "ancillary systems"
        ],
        "answer_text": "No element of the ATMS Data Systems shall interfere with or limit the operational functions of the ATMS software or any of the supporting ancillary systems. ADR and ADX will be operating as independent systems running on a separate database, and hence they will not interfere or limit the operational functions of the ATMS software."
    },
    {
        "look_id": 1374,
        "keywords": [
            "industry standards",
            "REST",
            "SOAP",
            "API"
        ],
        "answer_text": "Transnomis has designed data exchange with dozens of systems, including standards such as REST and SOAP-based API’s."
    },
    {
        "look_id": 1376,
        "keywords": [
            "data feeds",
            "inventory",
            "status information",
            "ITS Central"
        ],
        "answer_text": "Transnomis has created data feeds within ITS Central for various devices such as cameras, VMS, vehicle detectors, travel time, weather stations, etc., and the data feeds include inventory and status information."
    },
    {
        "look_id": 1373,
        "keywords": [
            "API",
            "data exchange",
            "third-party",
            "vendor-specific"
        ],
        "answer_text": "Transnomis has designed data exchange with dozens of systems, including third-party vendor-specific API-based methods."
    },
    {
        "look_id": 1375,
        "keywords": [
            "C2C",
            "API",
            "data export"
        ],
        "answer_text": "Transnomis will ensure that all of the existing C2C API will be maintained."
    },
    {
        "look_id": 1377,
        "keywords": [
            "weather",
            "data feed",
            "forecasts"
        ],
        "answer_text": "Transnomis will work with UDOT to design the data feed for weather information that includes forecasts."
    },
    {
        "look_id": 1379,
        "keywords": [
            "data retention",
            "configurable",
            "ADR"
        ],
        "answer_text": "Transnomis will work with UDOT to determine the data retention periods and configure archival and/or removal of data based on the data retention policy. Data retention periods will be configurable in the ADR."
    },
    {
        "look_id": 1378,
        "keywords": [
            "ADR",
            "device configuration",
            "inventory data"
        ],
        "answer_text": "Transnomis will work with UDOT to design the ADR to store device configuration and inventory data from the ATMS and other systems."
    },
    {
        "look_id": 1380,
        "keywords": [
            "data repository",
            "legacy data",
            "large data sets"
        ],
        "answer_text": "Transnomis will work with UDOT to design the ADR data repository structure such that it will have the ability to store new and old data with large volume of data."
    }
]