[
    {
        "look_id": 650,
        "keywords": [
            "commitment",
            "innovative solutions",
            "cost-effective",
            "safety",
            "integrity"
        ],
        "answer_text": "B&M is committed to implementing innovative and cost-effective solutions to its customers’ requirements on time, on budget, and with safety foremost in mind. Black & McDonald is a reliable and flexible contractor operating with integrity and loyalty to employees, customers, suppliers, and the communities we serve."
    },
    {
        "look_id": 651,
        "keywords": [
            "skilled workforce",
            "training",
            "expertise",
            "best practices"
        ],
        "answer_text": "B&M will provide a labour force whose selection is based on the required skills and level of expertise. This ensures that best practices and leading edge methodologies are implemented for every contract with which we work. Our staff members continuously train and update their skills, providing our clients with expertise and knowledge in all areas of operation, maintenance, health and safety."
    },
    {
        "look_id": 652,
        "keywords": [
            "health",
            "safety",
            "environment",
            "quality",
            "reputation"
        ],
        "answer_text": "B&M is committed to protecting their people, their property and the environment and will take all necessary steps to provide and maintain a safe and healthy work environment. With a track record of success spanning over ten decades, B&M has built a solid reputation based on our company’s mission of providing our customers with quality and service that is second to none."
    },
    {
        "look_id": 653,
        "keywords": [
            "design",
            "construction",
            "operation",
            "maintenance",
            "Travel Time System"
        ],
        "answer_text": "The project involves the design, construction, operation and maintenance of a new Travel Time (TT) System by replacing the existing TT system on multiple highway corridors in MTO Central Region, Ontario."
    },
    {
        "look_id": 703,
        "keywords": [
            "warranty",
            "Black & McDonald Limited",
            "labour",
            "equipment",
            "materials",
            "five years",
            "repair",
            "replacement",
            "Stinson AIS devices",
            "all-inclusive warranty"
        ],
        "answer_text": "Black & McDonald Limited will provide warranty on all labour, equipment and materials provided. Upon completion of installation, all equipment and materials delivered will be free of material defects and will perform to the requisite standard for a period of five (5) years. All materials provided and work executed under this contract are covered by the warranty. Black & McDonald Limited will repair or replace any equipment that fails throughout the warranty period at no additional expense to the MTO. The B&M will provide warranty services in accordance with the Service Level Agreement's response times for repair or replacement of equipment that has failed. The Stinson AIS devices will be provided with a 5 year all-inclusive warranty which will commence at the time of system acceptance. Advanced replacement spares will be provided to B&M maintenance staff to have on hand during any service calls. In the case that the contract is extended for an additional 2 years, the warranty will be extended accordingly as well."
    },
    {
        "look_id": 654,
        "keywords": [
            "Travel Time System",
            "design",
            "construction",
            "operation",
            "maintenance",
            "Ontario Ministry of Transportation",
            "VMS",
            "congestion"
        ],
        "answer_text": "The project involves the design, construction, operation and maintenance of a new Travel Time (TT) System by replacing the existing TT system on multiple highway corridors in MTO Central Region, Ontario. The travel time information will be displayed on MTO owned VMS to assist the public to find out the travel time along alternate routes and plan their route selections accordingly as well as reducing congestion in work zones and around incidents."
    },
    {
        "look_id": 655,
        "keywords": [
            "TT System",
            "Graphical User Interface",
            "Test Plan",
            "Pre-Installation Testing",
            "System Integration Testing",
            "Pilot Demonstration Testing",
            "System Acceptance Testing"
        ],
        "answer_text": "B&M is responsible to provide, host, and manage a TT System Graphical User Interface (GUI) for MTO users to access. B&M will be responsible for developing a Test Plan including Pre-Installation Testing (PIT), Proof of Performance (POP), System Integration Testing (SIT), Pilot Demonstration Testing (PDT) and System Acceptance Testing (SAT)."
    },
    {
        "look_id": 656,
        "keywords": [
            "job cost control",
            "Oracle JD Edwards",
            "Project Manager",
            "financials",
            "value engineering"
        ],
        "answer_text": "B&M utilizes a well-defined and monitored job cost control system using Oracle’s JD Edwards (JDE) which acts as an early warning system to enable the Project Manager to review live project financials at any given moment, unlike some elaborate systems which provide little more than historical data long after opportunities for value engineering have passed."
    },
    {
        "look_id": 657,
        "keywords": [
            "JDE",
            "change management",
            "Change Requests",
            "Change Order",
            "budget"
        ],
        "answer_text": "B&M uses JDE to track and manage the change management process for all projects. Change Requests contain important information regarding a potential customer Change Order including; brief description, reference numbers, associated dates and all required adjustments to estimated man-hours, cost and revenue which impact the overall budget of a job."
    },
    {
        "look_id": 658,
        "keywords": [
            "stakeholder management",
            "Project Managers",
            "stakeholder plan",
            "project scope risks"
        ],
        "answer_text": "B&M understands that effective stakeholder management is a key skill for our Project Managers who are accountable for end-to-end project management and execution. B&M creates a stakeholder plan that identifies the stakeholders, discusses goals, determines work methods and identifies project/work scope risks."
    },
    {
        "look_id": 659,
        "keywords": [
            "on-time",
            "on-budget",
            "Microsoft Project",
            "Project Scheduler",
            "Critical Path"
        ],
        "answer_text": "B&M prioritises on-time and on-budget project completion and uses Microsoft Project to achieve this goal. It enables all of the associated requirements, milestones, and ultimate completion dates involved in the completion of the project delivered through an integrated team method to be mutually established and easily updated. Every project is assigned to a dedicated Project Scheduler who is primarily responsible for assisting the Project Manager in scheduling activities such as creating baseline schedules, updating schedules weekly or biweekly to integrate change orders, defining and monitoring the Critical Path of the project, and rising any anticipated delays issues to the Project Manager."
    },
    {
        "look_id": 660,
        "keywords": [
            "Quality Assurance",
            "Quality Control",
            "evaluation",
            "improvement",
            "training sessions"
        ],
        "answer_text": "B&M has a Quality Assurance / Quality Control Policy and Program in place that will comply with our client's Quality Management needs' principles and objectives. Our Program was established to fulfill, and then surpass, our client's quality assurance standards through continual evaluation and improvement. The goal of B&M's Program is to increase efficiency and lower project costs while maintaining the highest level of quality in every performed work. Through training sessions, seminars, access to educational resources, and IMSA certification courses, B&M promotes quality work by developing and maintaining our workforce knowledge."
    },
    {
        "look_id": 661,
        "keywords": [
            "Stinson AIS sensor",
            "Factory Acceptance Tests",
            "Bluetooth detection",
            "WiFi detection",
            "burn in period"
        ],
        "answer_text": "The Stinson AIS sensor is designed and manufactured by Stinson ITS Inc. in its Woodbridge, ON facility. Each device goes through a series of Factory Acceptance Tests (FAT) which includes manual testing and verification of each subsystem component is functioning properly. These include verifying core device functions such as Bluetooth detection, WiFi detection, onboard Web Server operation, NTP sync, Factory reset and firmware update are operating correctly. After initial testing each device also goes through a 7 day burn in period. Devices are tested again upon completion of the burn in."
    },
    {
        "look_id": 662,
        "keywords": [
            "System Testing",
            "software errors",
            "MTO processes"
        ],
        "answer_text": "Comprehensive System Testing will also mitigate risks of software errors and issues. The project will undergo comprehensive testing, in adherence with standard MTO processes."
    },
    {
        "look_id": 663,
        "keywords": [
            "traffic management",
            "public safety",
            "construction",
            "traffic control plans"
        ],
        "answer_text": "B&M has in place a Public Protection & Traffic Management Planning tenet to make sure B&M authorized employees comprehend the necessities for and to provide protection for workers and the public by regulating traffic flow and implementing efficient traffic control plans."
    },
    {
        "look_id": 664,
        "keywords": [
            "occupational health",
            "safety",
            "workplace safety",
            "management commitment"
        ],
        "answer_text": "B&M believes that the measures we take will help drive B&M closer to our vision of a workplace where 'Nobody Gets Hurt Today or Tomorrow'. Our management team is committed to putting our people first in meeting our customer's challenges in the most critical environments."
    },
    {
        "look_id": 665,
        "keywords": [
            "Travel Time system",
            "Bluetooth",
            "WiFi",
            "data transmission",
            "ITS Central"
        ],
        "answer_text": "The Travel Time system will gather data from Bluetooth and Wifi detectors. The data will be transmitted to ITS Central control software, and be used to estimate travel times along roadways within the scope area, between detectors, and between specified origin destination pairs."
    },
    {
        "look_id": 666,
        "keywords": [
            "Stinson AIS",
            "Bluetooth detection",
            "MTO project",
            "accuracy",
            "penetration rates"
        ],
        "answer_text": "The Stinson AIS participated in an MTO project in 2016 to test a variety of alternative Bluetooth detection devices to determine their accuracy and penetration rates. The results of the testing confirmed that the Stinson AIS met industry standards for both metrics and as such were well suited for travel time applications on roadways."
    },
    {
        "look_id": 667,
        "keywords": [
            "solar systems",
            "standalone sites",
            "autonomy",
            "solar panel"
        ],
        "answer_text": "Stinson will be supplying solar systems for all of the standalone sites that are called for in this project. The system will provide 12 days of autonomy and will utilize a solar panel twice as large as is needed such that it can fully charge even in cloudy conditions or when the panel is partially covered in snow."
    },
    {
        "look_id": 668,
        "keywords": [
            "hosting",
            "OVH",
            "certifications",
            "data centers",
            "internet hosting"
        ],
        "answer_text": "For hosting, we propose the services of OVH (https://www.ovh.com/). It is one of the largest internet hosting companies in the world, with 400,000 servers, 33 data centers in 4 continents and 1.6 million customers. It is fully certified: PCI DSS, ISO/IEC 27001, 27017, 27018, 27701, 50001, SOC 1, SOC 2 and SOC 3, Cloud Security Alliance STAR certified."
    },
    {
        "look_id": 669,
        "keywords": [
            "servers",
            "OVH",
            "dedicated servers",
            "fail-over",
            "live streaming replication"
        ],
        "answer_text": "As part of the contract, Transnomis Solutions will procure three dedicated servers with OVH data center in Beauharnois, QC. One server will be the primary server hosting the ITS Central application. The second (fail-over) server will be used for live streaming replication, which will be ready to take over immediately should the primary server fails. The third server will also have live streaming replication serving as hot spare."
    },
    {
        "look_id": 704,
        "keywords": [
            "servers",
            "OVH",
            "triple redundancy",
            "fail-over",
            "streaming replication",
            "primary server",
            "secondary server",
            "tertiary server"
        ],
        "answer_text": "A total of 3 servers, hosted professionally by OVH within Canada, will be utilized in this project to achieve full system triple redundancy and fail-over. OVH has technician and security on-site 24/7. It has systematic double power supply, 250 kVA UPS and generators with an initial autonomy of 48 hours. It has a minimum of 2 network connections and two network rooms within each of its data centers. In addition to the primary server, an identical software installation will be created in two additional servers – one for failover and one for hot spare. The database will be set up with streaming replication such that the databases in all three (3) servers will always be in sync. In the event the primary server fails, the secondary server can quickly and automatically take over to become the primary server. Transnomis will then reconfigure streaming replication such that the secondary server will stream to the tertiary server, and reconfigure the failover to be the tertiary server. The failed server will then be replaced."
    },
    {
        "look_id": 670,
        "keywords": [
            "responsibility",
            "software service",
            "contact point",
            "server availability"
        ],
        "answer_text": "Although hosting is provided by reliable third party, Transnomis Solutions is fully responsible for the availability of its software service. The Ministry will never have to deal with the hosting company. Transnomis Solutions will be the single point of contact for all issues related to services provided for this contract, including server availability issues."
    },
    {
        "look_id": 671,
        "keywords": [
            "data hosting",
            "cloud-based solution",
            "Canada",
            "MTO premises"
        ],
        "answer_text": "Data shall be hosted and stored by the Proponent within Canada utilizing cloud-based solution, outside of MTO premises."
    },
    {
        "look_id": 672,
        "keywords": [
            "historical data",
            "storage",
            "auditing",
            "Bluetooth Readers"
        ],
        "answer_text": "The Proponent shall store a minimum of six (6) months of historical raw data for auditing purposes, including individual timestamped encrypted MAC ID records with their associated Bluetooth Readers."
    },
    {
        "look_id": 673,
        "keywords": [
            "data ownership",
            "MTO",
            "aggregated data",
            "archived data"
        ],
        "answer_text": "MTO shall own all data, including aggregated and archived data."
    },
    {
        "look_id": 674,
        "keywords": [
            "data dump",
            "MTO",
            "processed travel time data",
            "Central Region"
        ],
        "answer_text": "The Proponent shall perform a regular data dump to MTO. MTO to provide the Proponent with details on frequency of these data dumps and which data to include. Data to include at minimum processed travel time data for all links and routes in Central Region."
    },
    {
        "look_id": 675,
        "keywords": [
            "dashboard",
            "real-time travel time",
            "hardware",
            "Bluetooth reader",
            "VMS"
        ],
        "answer_text": "The GUI shall provide a dashboard for MTO to access real-time travel time and hardware (Bluetooth reader, VMS) information."
    },
    {
        "look_id": 676,
        "keywords": [
            "travel time index",
            "TTI",
            "links",
            "routes"
        ],
        "answer_text": "The dashboard shall provide information on travel time index (TTI) for links and routes. TTI = TT (real-time) / TT (free-flow)."
    },
    {
        "look_id": 677,
        "keywords": [
            "reporting system",
            "historical time period",
            "location"
        ],
        "answer_text": "The reporting system shall be able to report on any user-specified historical time period and location."
    },
    {
        "look_id": 678,
        "keywords": [
            "reports",
            "printer-friendly",
            "organized format"
        ],
        "answer_text": "The reports from the reporting system shall be generated in a printer-friendly and clearly organized format."
    },
    {
        "look_id": 679,
        "keywords": [
            "maintenance",
            "Proponent",
            "Term of Agreement"
        ],
        "answer_text": "The Proponent shall be responsible for all maintenance of the Solution during the Term of Agreement."
    },
    {
        "look_id": 680,
        "keywords": [
            "changes",
            "processes",
            "methodologies",
            "MTO"
        ],
        "answer_text": "In the event the Proponent makes any changes to its processes or methodologies during the Term of Agreement, including but not limited to data collection, processing methodology, storage, hosting, or cybersecurity, the Proponent shall inform MTO in detail of these changes in advance."
    },
    {
        "look_id": 681,
        "keywords": [
            "ITS Central",
            "Advanced Traffic Management System",
            "data retrieval",
            "Bluetooth Readers",
            "MTO",
            "QSVAS",
            "field devices"
        ],
        "answer_text": "Transnomis' ITS Central software is currently installed as the Advanced Traffic Management System in the City of Edmonton, Region of York, Region of Durham, MTO East Region, and BC Ferries. In addition, ITS Central is the control software being used for MTO's Queue and Stopped Vehicle Advisory System (QSVAS) on Highway 405, which is currently in the Operational Performance Test (OPT) period. ITS Central specializes in retrieving data and device status information from the field devices it’s integrated with, including the Stinson AIS Bluetooth/WiFi sensor, cellular modems, CCTV cameras, variable message signs, vehicle detectors, traffic signals, and various weather detection equipment (e.g., atmospheric sensors, wind meters, pavement sensors, etc.)."
    },
    {
        "look_id": 682,
        "keywords": [
            "scalability",
            "Bluetooth readers",
            "VMS",
            "future expansion"
        ],
        "answer_text": "ITS Central is designed to be fully scalable, to include future geographic expansion and inclusion of additional routes. In addition, adding additional Bluetooth readers and VMS’s is a common request by our previous clients, and can be easily accommodated."
    },
    {
        "look_id": 683,
        "keywords": [
            "continuous operation",
            "24/7",
            "high availability",
            "redundancy",
            "failover"
        ],
        "answer_text": "Our ITS Central software is designed to operate continuously, 24/7/365. Our ITS Central Advanced Traffic Management Systems in the City of Edmonton, Region of York, Region of Durham, MTO East Region, and BC Ferries operate continuously (24/7/365). MTO's QSVAS is also designed for continuous operations. Our systems in Toronto, Oklahoma, and California are also running 24/7/365. High availability features, and redundancy are designed within our proposed system, including triple servers, failover, device monitoring."
    },
    {
        "look_id": 684,
        "keywords": [
            "uptime",
            "redundancy",
            "triple servers",
            "OVH",
            "99% uptime"
        ],
        "answer_text": "Professional third-party hosting, and triple servers are proposed to achieve 99% uptime, with an expected uptime of better than 99.99% excluding scheduled maintenance. A total of 3 servers, hosted professionally by OVH within Canada, will be utilized in this project to achieve full system triple redundancy and fail-over."
    },
    {
        "look_id": 685,
        "keywords": [
            "compliance",
            "security requirements",
            "Government of Ontario",
            "ITS Central"
        ],
        "answer_text": "ITS Central complies with all Government of Ontario Information Technology Standards security requirements."
    },
    {
        "look_id": 686,
        "keywords": [
            "IPSec VPN",
            "collaboration",
            "MTO",
            "secure data transmission"
        ],
        "answer_text": "The project team will collaborate with MTO to establish a site-to-site IPSec VPN tunnel between the ITS Central server and MTO firewall."
    },
    {
        "look_id": 687,
        "keywords": [
            "algorithm",
            "travel times",
            "data processing",
            "filtering",
            "configurable parameters"
        ],
        "answer_text": "ITS Central employs advanced algorithmic calculation of travel times between sensors by aggregating and filtering the raw travel time data eliminating aberrations and outliers. The parameters for this algorithm are configurable."
    },
    {
        "look_id": 688,
        "keywords": [
            "data hosting",
            "cloud-based solution",
            "OVH",
            "Canada",
            "security",
            "Transnomis Solutions",
            "responsibility"
        ],
        "answer_text": "Data shall be hosted and stored by the Proponent within Canada utilizing cloud-based solution, outside of MTO premises. For hosting, we propose the services of OVH (https://www.ovh.com/). It is one of the largest internet hosting companies in the world, with 400,000 servers, 33 data centers in 4 continents and 1.6 million customers. It is fully certified: PCI DSS, ISO/IEC 27001, 27017, 27018, 27701, 50001, SOC 1, SOC 2 and SOC 3, Cloud Security Alliance STAR certified. OVH.com has a data center in Beauharnois, QC. Its facility is highly secure with access only by authorized employees. It has technician and security on-site 24/7. It has systematic double power supply, 250 kVA UPS and generators with an initial autonomy of 48 hours. It has a minimum of 2 network connections and two network rooms within each of its data centers. Although hosting is provided by reliable third party, Transnomis Solutions is fully responsible for the availability of its software service. The Ministry will never have to deal with the hosting company. Transnomis Solutions will be the single point of contact for all issues related to services provided for this contract, including server availability issues."
    },
    {
        "look_id": 689,
        "keywords": [
            "historical data",
            "aggregated travel time",
            "ITS Central",
            "contract duration"
        ],
        "answer_text": "Historical aggregated travel time information shall be stored and accessible to users for the duration of the Contract. Historical aggregated travel time information is stored in ITS Central's database, and will be accessible for the duration of the contract."
    },
    {
        "look_id": 690,
        "keywords": [
            "historical raw data",
            "auditing",
            "Bluetooth Readers",
            "timestamped records"
        ],
        "answer_text": "The Proponent shall store a minimum of six (6) months of historical raw data for auditing purposes, including individual timestamped encrypted MAC ID records with their associated Bluetooth Readers. ITS Central will store the historical raw data for a minimum of 6 months, including individual timestamped encrypted MAC ID records with their associated Bluetooth Readers."
    },
    {
        "look_id": 691,
        "keywords": [
            "data ownership",
            "MTO",
            "aggregated data",
            "archived data"
        ],
        "answer_text": "MTO shall own all data, including aggregated and archived data. MTO will own all data including raw, aggregated and archived data."
    },
    {
        "look_id": 692,
        "keywords": [
            "reporting",
            "customization",
            "MTO",
            "ITS Central"
        ],
        "answer_text": "Transnomis will customize reports within ITS Central to address all of MTO's needs."
    },
    {
        "look_id": 693,
        "keywords": [
            "Black & McDonald",
            "System Operational Support",
            "Warranty",
            "Emergency Repairs",
            "Routine Maintenance",
            "Service Level Agreement"
        ],
        "answer_text": "Black & McDonald (B&M) will be responsible for System Operational Support, Warranty, System Emergency Repairs, and System Routine Maintenance for the TT system. B&M will maintain fault free operation of the TT system including the hardware and software parts as well as maintaining effective working conditions according to the contract's specifications. B&M project management team will review the restrictions outline in Appendix C3 and create a maintenance plan based on information provided. The maintenance team will carry out successful coordination with any other contractors to stay away from working in the same area by providing the advanced notice to the contract administrator or representative from general contractors. All activities will follow the requirements specified in the Service Level Agreement to ensure equipment and system performance levels are met throughout the life of the Contract."
    },
    {
        "look_id": 694,
        "keywords": [
            "monitoring",
            "ITS components",
            "Black & McDonald",
            "MTO",
            "system performance",
            "incident reporting"
        ],
        "answer_text": "During the operational and maintenance phases of the contract, Black & McDonald will be responsible for monitoring the operation of all ITS components including BT readers installed under the contract. B&M will immediately notify the MTO if any MTO-supplied material or equipment (existing or new) is discovered to be broken or faulty, affecting system performance. Field devices will be monitored by ITS Central, and notifications will be sent to B&M if a device failure is detected. In line with the Agreement, the MTO will decide on a course of action with respect to such material or equipment. When Black & McDonald Limited is notified of an occurrence, it must respond within the specified time frame. Any incidents will be documented in detail and reported to the MTO, with a summary of the root cause and corrective action taken."
    },
    {
        "look_id": 695,
        "keywords": [
            "technical support",
            "response times",
            "SLA",
            "penalties",
            "outages"
        ],
        "answer_text": "B&M will ensure that technical support response times will comply with response and resolution limit requirements and associated penalties for outages as outlined in the SLA section 3.2."
    },
    {
        "look_id": 696,
        "keywords": [
            "communication",
            "project team",
            "MTO",
            "monitoring",
            "emergency response"
        ],
        "answer_text": "B&M believes that continuous communication between the project team and the MTO is essential to ensure that issues arising from production, operation, and maintenance are closely and rapidly monitored as well as appropriate emergency response plans are provided."
    },
    {
        "look_id": 697,
        "keywords": [
            "Scheduled System Maintenance Plan",
            "MTO",
            "approval",
            "staff responsibilities",
            "resources"
        ],
        "answer_text": "A Scheduled System Maintenance Plan will be submitted to the MTO for approval one month prior to SLA initiation. This plan will indicate all staff, staff responsibilities, resources, schedules and operating guidelines."
    },
    {
        "look_id": 698,
        "keywords": [
            "safety management",
            "environmental management",
            "MTO",
            "risk mitigation",
            "protection strategy"
        ],
        "answer_text": "A comprehensive project safety and environmental management plan will be developed and submitted to the MTO for review. The project's safety and environmental protection plan will go through site-specific safety hazards, risk mitigation measures, and environmental protection strategy."
    },
    {
        "look_id": 699,
        "keywords": [
            "monthly service report",
            "template",
            "maintenance services",
            "MTO"
        ],
        "answer_text": "The project team will prepare a template for monthly field maintenance service. The template will be completed on a monthly basis, based on maintenance services provided and submitted to the MTO."
    },
    {
        "look_id": 700,
        "keywords": [
            "materials management",
            "equipment management",
            "response times",
            "inventory",
            "digital system"
        ],
        "answer_text": "The management of materials and equipment is crucial to maintaining quick response and repair times. All spare parts, materials, and consumables will be inventoried and placed into a digital inventory management system."
    },
    {
        "look_id": 701,
        "keywords": [
            "on-call crew",
            "emergency call",
            "dispatch center",
            "MTO"
        ],
        "answer_text": "The on-call crew will be briefed on the category of the call and sent after receiving an emergency call at either the 24/7 hour dispatch center or via the list of contacts provided to the MTO."
    },
    {
        "look_id": 702,
        "keywords": [
            "emergency maintenance",
            "reporting",
            "non-routine maintenance",
            "log book",
            "ITS asset"
        ],
        "answer_text": "To ensure reports of all emergency maintenance activities are recorded in detail and available. For all call out actions, the non-routine maintenance log book will be updated every time an attendance to an electrical or ITS asset is made."
    }
]